{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: ipython-cypher in c:\\programdata\\anaconda3\\lib\\site-packages (0.2.6)\n",
      "Requirement already satisfied: ipython>=1.0 in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython-cypher) (7.6.1)\n",
      "Requirement already satisfied: prettytable in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython-cypher) (0.7.2)\n",
      "Requirement already satisfied: neo4jrestclient>=2.1.0 in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython-cypher) (2.1.1)\n",
      "Requirement already satisfied: pygments in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (2.4.2)\n",
      "Requirement already satisfied: decorator in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (4.4.0)\n",
      "Requirement already satisfied: setuptools>=18.5 in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (41.0.1)\n",
      "Requirement already satisfied: traitlets>=4.2 in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (4.3.2)\n",
      "Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (2.0.9)\n",
      "Requirement already satisfied: colorama; sys_platform == \"win32\" in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (0.4.1)\n",
      "Requirement already satisfied: backcall in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (0.1.0)\n",
      "Requirement already satisfied: pickleshare in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (0.7.5)\n",
      "Requirement already satisfied: jedi>=0.10 in c:\\programdata\\anaconda3\\lib\\site-packages (from ipython>=1.0->ipython-cypher) (0.13.3)\n",
      "Requirement already satisfied: requests>=2.1.0 in c:\\programdata\\anaconda3\\lib\\site-packages (from neo4jrestclient>=2.1.0->ipython-cypher) (2.22.0)\n",
      "Requirement already satisfied: six in c:\\programdata\\anaconda3\\lib\\site-packages (from traitlets>=4.2->ipython>=1.0->ipython-cypher) (1.12.0)\n",
      "Requirement already satisfied: ipython-genutils in c:\\programdata\\anaconda3\\lib\\site-packages (from traitlets>=4.2->ipython>=1.0->ipython-cypher) (0.2.0)\n",
      "Requirement already satisfied: wcwidth in c:\\programdata\\anaconda3\\lib\\site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-cypher) (0.1.7)\n",
      "Requirement already satisfied: parso>=0.3.0 in c:\\programdata\\anaconda3\\lib\\site-packages (from jedi>=0.10->ipython>=1.0->ipython-cypher) (0.5.0)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in c:\\programdata\\anaconda3\\lib\\site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (2019.6.16)\n",
      "Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in c:\\programdata\\anaconda3\\lib\\site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (1.24.2)\n",
      "Requirement already satisfied: idna<2.9,>=2.5 in c:\\programdata\\anaconda3\\lib\\site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (2.8)\n",
      "Requirement already satisfied: chardet<3.1.0,>=3.0.2 in c:\\programdata\\anaconda3\\lib\\site-packages (from requests>=2.1.0->neo4jrestclient>=2.1.0->ipython-cypher) (3.0.4)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "#Need to start neo4j\n",
    "#Install neo4j adaptor\n",
    "pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import subprocess as sp\n",
    "\n",
    "sp.call(\"powershell Start-Process 'C:/Program Files/Neo4j Desktop/resources/offline/neo4j/neo4j-enterprise-3.5.6-windows.zip/neo4j-enterprise-3.5.6/bin/neo4j.bat' start -verb runAs\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Connected: http://neo4j:test@localhost:7474/db/data/'"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#%cypher http://username:password@localhost:7474/db/data/\n",
    "%cypher http://neo4j:test@localhost:7474/db/data/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u1.name</th>\n",
       "      <th>u2.name</th>\n",
       "      <th>i.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>salt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>egg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>white sugar</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       u1.name      u2.name            i.name\n",
       "0  Orange Buns  Dilly Bread              salt\n",
       "1  Orange Buns  Dilly Bread               egg\n",
       "2  Orange Buns  Dilly Bread       white sugar\n",
       "3  Orange Buns  Dilly Bread  active dry yeast"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (u1:recipes {name:\"Orange Buns\"})-[r1:CONTAINS]->(i:ingredients)<-[r2:CONTAINS]-(u2:recipes {name:\"Dilly Bread\"}) RETURN DISTINCT u1.name, u2.name, i.name ORDER BY u2.name\n",
    "#results = %cypher MATCH (u1:recipes {name:\"Orange Buns\"})-[r1:CONTAINS]->(i:ingredients)<-[r2:CONTAINS]-(u2:recipes {name:\"Dilly Bread\"}) RETURN i.name ORDER BY u2.name\n",
    "results.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "25 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u1.name</th>\n",
       "      <th>u2.name</th>\n",
       "      <th>i.name</th>\n",
       "      <th>i1.name</th>\n",
       "      <th>i2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Grandma Cornish's Whole Wheat Potato Bread</td>\n",
       "      <td>Cornish Splits</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Onion Bread I</td>\n",
       "      <td>Sun Dried Tomato and Asiago Cheese Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Canadian Doughnuts</td>\n",
       "      <td>Sun Dried Tomato Focaccia</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>Mom's Yeast Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Potato Bread I</td>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Sweet Potato Rolls</td>\n",
       "      <td>Sourdough Bread II</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mom's Hazelnut Special</td>\n",
       "      <td>English Muffin Loaves</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Cinnamon Cranraisin Bread</td>\n",
       "      <td>Cottage Dill Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>Mom's Hazelnut Special</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Grandma Cornish's Whole Wheat Potato Bread</td>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Sunday Dinner Rolls</td>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Cardamom Bread</td>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Sun Dried Tomato Focaccia</td>\n",
       "      <td>Sunday Dinner Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>Pecan Sticky Buns</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Unbelievable Rolls</td>\n",
       "      <td>Onion Bread I</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Pecan Sticky Buns</td>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Sweet Potato Rolls</td>\n",
       "      <td>Fabulous Homemade Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Sy's Challah</td>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>Unbelievable Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>Cardamom Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Sourdough Bread II</td>\n",
       "      <td>Cornish Splits</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Sunday Dinner Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Sy's Challah</td>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       u1.name  \\\n",
       "0   Grandma Cornish's Whole Wheat Potato Bread   \n",
       "1                                Onion Bread I   \n",
       "2                           Canadian Doughnuts   \n",
       "3                  No Knead Refrigerator Rolls   \n",
       "4                               Potato Bread I   \n",
       "5                           Sweet Potato Rolls   \n",
       "6                       Mom's Hazelnut Special   \n",
       "7                    Cinnamon Cranraisin Bread   \n",
       "8                      Molasses-Oat Bran Bread   \n",
       "9   Grandma Cornish's Whole Wheat Potato Bread   \n",
       "10                         Sunday Dinner Rolls   \n",
       "11                              Cardamom Bread   \n",
       "12                   Sun Dried Tomato Focaccia   \n",
       "13                 No Knead Refrigerator Rolls   \n",
       "14                          Unbelievable Rolls   \n",
       "15                 No Knead Refrigerator Rolls   \n",
       "16                           Pecan Sticky Buns   \n",
       "17                 No Knead Refrigerator Rolls   \n",
       "18                          Sweet Potato Rolls   \n",
       "19                                Sy's Challah   \n",
       "20              Grandma VanDoren's White Bread   \n",
       "21                     Molasses-Oat Bran Bread   \n",
       "22                          Sourdough Bread II   \n",
       "23                                 Orange Buns   \n",
       "24                                Sy's Challah   \n",
       "\n",
       "                                     u2.name       i.name i1.name  \\\n",
       "0                             Cornish Splits  white sugar    salt   \n",
       "1   Sun Dried Tomato and Asiago Cheese Bread  white sugar    salt   \n",
       "2                  Sun Dried Tomato Focaccia  white sugar    salt   \n",
       "3                          Mom's Yeast Rolls  white sugar    salt   \n",
       "4                                Orange Buns  white sugar    salt   \n",
       "5                         Sourdough Bread II  white sugar    salt   \n",
       "6                      English Muffin Loaves  white sugar    salt   \n",
       "7                         Cottage Dill Bread  white sugar    salt   \n",
       "8                     Mom's Hazelnut Special  white sugar    salt   \n",
       "9                No Knead Refrigerator Rolls  white sugar    salt   \n",
       "10            Grandma VanDoren's White Bread  white sugar    salt   \n",
       "11                   Molasses-Oat Bran Bread  white sugar    salt   \n",
       "12                       Sunday Dinner Rolls  white sugar    salt   \n",
       "13                         Pecan Sticky Buns  white sugar    salt   \n",
       "14                             Onion Bread I  white sugar    salt   \n",
       "15                               Orange Buns  white sugar    salt   \n",
       "16            Grandma VanDoren's White Bread  white sugar    salt   \n",
       "17                               Dilly Bread  white sugar    salt   \n",
       "18                   Fabulous Homemade Bread  white sugar    salt   \n",
       "19               No Knead Refrigerator Rolls  white sugar    salt   \n",
       "20                        Unbelievable Rolls  white sugar    salt   \n",
       "21                            Cardamom Bread  white sugar    salt   \n",
       "22                            Cornish Splits  white sugar    salt   \n",
       "23                       Sunday Dinner Rolls  white sugar    salt   \n",
       "24                   Molasses-Oat Bran Bread  white sugar    salt   \n",
       "\n",
       "             i2.name  \n",
       "0   active dry yeast  \n",
       "1   active dry yeast  \n",
       "2   active dry yeast  \n",
       "3   active dry yeast  \n",
       "4   active dry yeast  \n",
       "5   active dry yeast  \n",
       "6   active dry yeast  \n",
       "7   active dry yeast  \n",
       "8   active dry yeast  \n",
       "9   active dry yeast  \n",
       "10  active dry yeast  \n",
       "11  active dry yeast  \n",
       "12  active dry yeast  \n",
       "13  active dry yeast  \n",
       "14  active dry yeast  \n",
       "15  active dry yeast  \n",
       "16  active dry yeast  \n",
       "17  active dry yeast  \n",
       "18  active dry yeast  \n",
       "19  active dry yeast  \n",
       "20  active dry yeast  \n",
       "21  active dry yeast  \n",
       "22  active dry yeast  \n",
       "23  active dry yeast  \n",
       "24  active dry yeast  "
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results1 = %cypher MATCH (u1:recipes)--(i:ingredients {name:\"white sugar\"})--(u2:recipes) \\\n",
    "MATCH (u1:recipes)--(i1:ingredients {name:\"salt\"})--(u2:recipes) \\\n",
    "MATCH (u1:recipes)--(i2:ingredients {name:\"active dry yeast\"})--(u2:recipes) \\\n",
    "RETURN DISTINCT u1.name, u2.name, i.name, i1.name, i2.name LIMIT 25;\n",
    "results1.get_dataframe()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pip install pyviz"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
