{"author": "Flute", "cook_time_minutes": 5, "description": "Some wheat bread recipes are hard to make, but this isn't one of them, thanks to the use of your bread machine.", "error": false, "footnotes": [], "ingredients": ["1 1/2 teaspoons active dry yeast", "3 cups whole wheat flour", "1 1/2 teaspoons salt", "1 1/2 tablespoons white sugar", "1 1/2 tablespoons nonfat dry milk powder", "1 1/2 tablespoons margarine", "1 1/4 cups warm water (110 degrees F/45 degrees C)"], "instructions": ["Place ingredients in the bread machine pan in the order suggested by the manufacturer.", "Select Whole Wheat or Basic Bread setting. Press Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/7666.jpg", "prep_time_minutes": 180, "rating_stars": 4.3, "review_count": 194, "time_scraped": 1498206856, "title": "Good 100% Whole Wheat Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/6963/"}
{"author": "Nancy Scott", "cook_time_minutes": 10, "description": "Excellent for Christmas gifts, as persimmons are only available for a brief time. Moist spice cake type bread. This is the top seller at our company bake sale at Christmas!", "error": false, "footnotes": [], "ingredients": ["1 cup persimmon pulp", "2 teaspoons baking soda", "3 cups white sugar", "1 cup vegetable oil", "4 eggs", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon ground nutmeg", "1 1/2 teaspoons salt", "2/3 cup water", "3 cups all-purpose flour", "1 cup chopped walnuts"], "instructions": ["Preheat the oven to 350 degrees F (175 degrees C). Grease three 6x3 inch loaf pans.", "In a small bowl, stir together the persimmon pulp and baking soda. Let stand 5 minutes to thicken the pulp.", "In a medium bowl, combine sugar, oil, eggs, cinnamon, nutmeg, and salt. Blend until smooth. Mix in persimmon pulp and water alternately with flour. Fold in nuts. Divide batter into the prepared pans, filling each pan 2/3 full.", "Bake for 1 hour in the preheated oven, or until a toothpick inserted comes out clean. Cool in pan for 10 minutes before removing to a wire rack to cool completely."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1852566.jpg", "prep_time_minutes": 60, "rating_stars": 4.5, "review_count": 121, "time_scraped": 1498205417, "title": "Persimmon Bread II", "total_time_minutes": 70, "url": "http://allrecipes.com/Recipe/6964/"}
{"author": "Lynette Kleinschmidt", "cook_time_minutes": 10, "description": "Never enough peanut butter?  Try this bread for your next peanut butter and jelly sandwich.", "error": false, "footnotes": [], "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "3/4 teaspoon salt", "1/3 cup white sugar", "3/4 cup creamy peanut butter", "1 cup milk", "1 egg"], "instructions": ["Preheat oven to 350 degree F (175 degrees C). Coat a 9 x 5 inch loaf pan with vegetable cooking spray.", "Combine flour, baking powder, salt, and sugar in a bowl. Add the peanut butter, and mix in with a pastry blender. Add milk to beaten egg, and pour this mixture into the flour mixture. Stir until thoroughly combined; do not beat. Spread batter into prepared pan.", "Bake for 50 to 55 minutes. Cool before slicing."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/10971.jpg", "prep_time_minutes": 55, "rating_stars": 3.84, "review_count": 17, "time_scraped": 1498200118, "title": "Peanut Butter Sandwich Loaf", "total_time_minutes": 65, "url": "http://allrecipes.com/Recipe/6965/"}
{"author": "Anne Williamson", "cook_time_minutes": 40, "description": "Salted or seeded, these make a great snack.", "error": false, "footnotes": [], "ingredients": ["1 teaspoon white sugar", "1/4 cup warm water (110 degrees F/45 degrees C)", "1 1/4 teaspoons active dry yeast", "1 1/2 cups warm water (110 degrees F/45 degrees C)", "4 1/2 cups all-purpose flour", "1/2 teaspoon salt", "1 egg", "1 teaspoon water", "2 tablespoons kosher salt", "1 tablespoon sesame seeds"], "instructions": ["Stir sugar into 1/4 cup warm water in a small bowl. Sprinkle yeast over top. Let stand for 10 minutes. Stir to dissolve yeast.", "Combine 1 1/2 cups warm water, flour, and salt in large bowl. Stir yeast into mixture. Add a bit more flour, if needed, so dough isn't too sticky.", "Knead for 8 to 10 minutes until dough is smooth and elastic. Place in greased bowl, turning once to grease top. Cover with tea towel. Let stand in oven with light on and door closed about 45 minutes, or until doubled in bulk.", "Punch dough down. Roll into log. Mark off into 12 portions, and cut. Roll each portion into 1/2 inch rope. Shape each rope into pretzel form on greased baking sheets. Beat egg white and 1 teaspoon water with fork in small bowl; brush glaze on pretzels. Sprinkle some pretzels with kosher salt, and some with sesame seeds.", "Bake at 450 degrees (230 degrees C) for about 15 minutes. Turn out onto racks to cool."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/6321.jpg", "prep_time_minutes": 15, "rating_stars": 4.06, "review_count": 25, "time_scraped": 1498207453, "title": "Soft Pretzels II", "total_time_minutes": 110, "url": "http://allrecipes.com/Recipe/6966/"}
{"author": "Bev Austin", "cook_time_minutes": 10, "description": "This is great served on a cold, wintry day.  Use any kind of mincemeat, purchased or homemade, and serve with butter or cream cheese.", "error": false, "footnotes": [], "ingredients": ["2 cups all-purpose flour", "1/2 cup white sugar", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1 egg", "1/4 cup vegetable oil", "1 tablespoon orange zest", "2 tablespoons orange juice", "2 cups prepared mincemeat pie filling"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9 x 5 x 3 inch loaf pan.", "Mix together the egg, oil, orange peel, juice, and mincemeat, blending well. Combine flour, sugar, baking powder, baking soda, and salt; add gradually to the egg mixture. Mix just until moist. Pour into prepared pan.", "Bake for 1 hour. Remove the loaf from the oven, and cool on a wire rack."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/853713.jpg", "prep_time_minutes": 60, "rating_stars": 4.28, "review_count": 27, "time_scraped": 1498209364, "title": "Mincemeat Quick Bread", "total_time_minutes": 70, "url": "http://allrecipes.com/Recipe/6967/"}
{"author": "Katherine Foster", "cook_time_minutes": 40, "description": "A sweet roll with a creamy poppy seed filling.", "error": false, "footnotes": [], "ingredients": ["2 cups all-purpose flour", "1 (.25 ounce) package active dry yeast", "1 cup warm milk", "1/4 cup white sugar", "1/4 cup shortening", "1 teaspoon salt", "2 eggs, beaten", "1 3/4 cups all-purpose flour", "1/2 pound poppy seeds", "1/2 cup margarine, softened", "1/2 cup honey", "2 cups heavy cream", "1 cup finely chopped walnuts", "1 1/2 cups raisins", "1 teaspoon orange zest"], "instructions": ["Place the poppy seeds in a bowl and cover with boiling water. Let soak for 1 hour.", "Stir together milk, sugar, shortening, and salt. Stir until shortening melts. Cool mixture to lukewarm. Mix yeast with 2 cups flour; mix into milk mixture. Stir in eggs. Work in enough of the remaining flour to make a moderately stiff dough. Turn dough out onto a lightly floured surface, and knead until smooth. Place in a well oiled bowl, and turn to coat the surface. Cover, and let rise until doubled in size.", "Drain poppy seeds well, and put through the finest blade of a grinder 3 times. Cream butter or margarine and honey. Add cream, and stir in poppy seeds, nuts, raisins and grated peel. Add more cream if necessary to spread thinly over dough.", "Deflate dough, and divide in half. Roll each half to a 12 x 8 inch rectangle. Spread with poppy seed filling. Roll up, jelly-roll fashion, from long edge. Slice each into 12 pieces, and place cut side down in greased 9 inch round cake pans. Let rise until doubled in bulk.", "Bake at 375 degrees F (190 degrees C) for 18 to 20 minutes."], "photo_url": "http://images.media-allrecipes.com/global/recipes/nophoto/nopicture-910x511.png", "prep_time_minutes": 20, "rating_stars": 3.5, "review_count": 4, "time_scraped": 1498206052, "title": "Poppy Seed Rolls", "total_time_minutes": 1000, "url": "http://allrecipes.com/Recipe/6968/"}
{"author": "Janie", "cook_time_minutes": 10, "description": "Use canned peaches to make this quick bread recipe for a cinnamon-accented loaf perfect for the holiday table.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["3 eggs", "2 cups white sugar", "2 teaspoons vanilla extract", "1 cup vegetable oil", "2 cups diced canned peaches, drained", "3 cups all-purpose flour", "1 teaspoon baking powder", "1 teaspoon salt", "1 teaspoon baking soda", "3 teaspoons ground cinnamon", "1/2 cup chopped walnuts (optional)"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8 x 4 inch loaf pans.", "In a large bowl, beat the eggs lightly. Blend in the sugar, oil, and vanilla. Add flour, baking powder, baking soda, salt, and cinnamon; mix just to combine. Stir in the peaches and nuts. Pour batter into prepared pans.", "Bake for about 1 hour, or until a tester inserted in the center comes out clean."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/2206948.jpg", "prep_time_minutes": 60, "rating_stars": 4.31, "review_count": 203, "time_scraped": 1498206210, "title": "Peach Bread", "total_time_minutes": 70, "url": "http://allrecipes.com/Recipe/6969/"}
{"author": "Pet", "cook_time_minutes": 20, "description": "Small buns that resemble butterflies. All kids love them", "error": false, "footnotes": [], "ingredients": ["1 cup self-rising flour", "1/4 cup unsweetened cocoa powder", "1 tablespoon hot water", "1/4 cup margarine", "1/4 cup white sugar", "1 egg", "1/4 cup margarine", "1 1/2 cups confectioners' sugar", "1/2 teaspoon vanilla extract", "2 tablespoons cherry jam"], "instructions": ["Preheat oven 350 F (175 degrees C). Line a 12-cup-muffin-pan with paper baking cups.", "Cream 1/4 cup butter or margarine and white sugar together until pale yellow and fluffy. Gradually add small amounts of beaten egg, beating continuously. In a small bowl, combine cocoa powder and hot water. Stir cocoa mixture into batter. Fold in flour using figure eight movement. If the mixture is too stiff, batter should slowly drop off spoon when lifted from bowl, add a small amount of water. Divide mixture into 12 muffin cups.", "Bake for 15 to 20 minutes, or until well risen and firm to touch. Allow to cool.", "Cream 1/4 cup butter or margarine until soft. Gradually add sifted confectioners sugar and vanilla extract. Mix cream filling until smooth.", "Cut circles from tops of muffins, and halve these to resemble butterfly wings. Put a small amount of cherry jam in the cut out hole, and cover with a teaspoon of cream filling. Place the wing shapes into the cream filling curved side down."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/251234.jpg", "prep_time_minutes": 20, "rating_stars": 4.17, "review_count": 5, "time_scraped": 1498205485, "title": "Butterfly Buns", "total_time_minutes": 40, "url": "http://allrecipes.com/Recipe/6970/"}
{"author": "Merrilee", "cook_time_minutes": 5, "description": "Our family goes through a loaf of this every day. Slightly sweet, and light. Great with dinner, and a favorite for sandwiches.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 cup water", "1 tablespoon vegetable oil", "1/4 cup honey", "1 teaspoon salt", "1/2 cup rolled oats", "2 1/3 cups bread flour", "1 teaspoon active dry yeast"], "instructions": ["Place ingredients in bread machine pan in the order suggested by the manufacturer.", "Select Light Crust or Basic setting, and press Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/450992.jpg", "prep_time_minutes": 180, "rating_stars": 4.74, "review_count": 461, "time_scraped": 1498207511, "title": "Honey Of An Oatmeal Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/6971/"}
{"author": "Esther Kenagy", "cook_time_minutes": 20, "description": "This bread is delicious plain or toasted.  I make it at least once a week.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 1/2 cups buttermilk", "1/2 cup warm water (110 degrees F/45 degrees C)", "1/2 cup margarine", "1/4 cup white sugar", "1/2 teaspoon baking soda", "2 (.25 ounce) packages active dry yeast", "2 teaspoons salt", "5 1/2 cups bread flour"], "instructions": ["Proof yeast in warm water.", "Place the butter or margarine and buttermilk in a small saucepan. Heat slowly until butter or margarine has melted. Cool to lukewarm.", "Place sugar, salt, baking soda, buttermilk mixture, and yeast in large mixing bowl. Add 3 cups flour one cup at a time, and mix with the dough hook attachment of an electric mixer. Gradually add the remaining flour while continuing to mix. When dough is not sticky, turn out on a lightly floured surface. Knead for several minutes, until the dough is soft and smooth. Place in a greased bowl, and turn once. Allow to rise until doubled in size.", "Punch down the dough. Divide, and shape into 2 loaves. Place in two well greased 8 x 4 inch bread pans. Allow to rise until dough has risen one inch above pans.", "Bake in a preheated 375 degrees F (190 degrees C) oven for 30 to 35 minutes. Loaves are done when nicely brown and hollow sounding when thumped."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/3467.jpg", "prep_time_minutes": 35, "rating_stars": 4.72, "review_count": 118, "time_scraped": 1498210648, "title": "Buttermilk Bread II", "total_time_minutes": 180, "url": "http://allrecipes.com/Recipe/6972/"}
{"author": "Ruth", "cook_time_minutes": 30, "description": "This is a white yeast bread with a sweet poppy seed filling.", "error": false, "footnotes": [], "ingredients": ["5 1/2 cups all-purpose flour", "2 (.25 ounce) packages active dry yeast", "1 1/2 cups milk", "1/3 cup white sugar", "1/3 cup shortening", "1 teaspoon salt", "3 eggs", "1 cup boiling water", "3/4 cup poppy seeds", "1/2 cup chopped walnuts", "1/3 cup honey", "1 teaspoon grated lemon zest", "1 egg white"], "instructions": ["In a saucepan, heat together milk, sugar, shortening, and salt until warm.", "Combine 2 cups of the flour and the yeast in a large mixing bowl. Stir in warm milk mixture. Add 3 eggs; beat with an electric mixer at low speed for 1/2 min, scraping sides of bowl constantly. Beat for 3 minutes at high speed. Stir in as much of remaining flour as you can. Turn out onto a lightly floured surface. Knead in remaining flour to make a stiff dough, and continue kneading for 6 to 8 minutes. Place dough in a lightly greased bowl, and turn once to grease surface. Cover, and let rise in a warm place until doubled.", "Meanwhile, pour boiling water over poppy seeds; let stand 30 minutes. Drain thoroughly, and place in a blender. Grind. In a small bowl, blend together ground poppy seeds, chopped nuts, honey, and lemon zest. Beat 1 egg white until stiff, and fold into poppy seed mixture.", "Punch down dough, and divide in half. Cover, and let rest for 10 minutes. On a lightly floured surface, roll half of the dough into 24 x 8 inch rectangle. Spread with half the poppy seed mixture. Roll up jelly roll style, starting with the narrow edge. Seal the edge. Place seam side down, in a greased 8 x 4 inch loaf pan. Repeat with the other half of the dough. Cover. Let rise for 30 to 45 minutes, or until doubled.", "Bake in a preheated 350 degrees F (175 degrees C) oven for 35 to 40 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/14001.jpg", "prep_time_minutes": 40, "rating_stars": 4.0, "review_count": 2, "time_scraped": 1498207402, "title": "Poppy Seed Loaf", "total_time_minutes": 180, "url": "http://allrecipes.com/Recipe/6973/"}
{"author": "Ruth", "cook_time_minutes": 15, "description": "A tasty loaf similar to a scone. Perfect for breakfast or as a snack with tea or coffee.", "error": false, "footnotes": [], "ingredients": ["2 cups all-purpose flour", "2 tablespoons white sugar", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "2 tablespoons butter", "1 cup buttermilk", "1/2 cup dried currants"], "instructions": ["Combine flour, sugar, baking soda, baking powder, and salt. Cut butter into flour mixture with pastry cutter. Add buttermilk until dough is soft. Stir in currants.", "Turn dough out onto a lightly floured surface. Knead for 5 minutes, or until smooth. Form dough into a 7 inch round. Place on a lightly oiled cake pan or cookie sheet. Cut 1/2 inch deep cross side to side. Score with cross 1/2 inch deep on the top.", "Bake in a preheated 375 degrees F (190 degrees C) oven for 40 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/32775.jpg", "prep_time_minutes": 40, "rating_stars": 4.59, "review_count": 56, "time_scraped": 1498206660, "title": "Irish Bannock", "total_time_minutes": 55, "url": "http://allrecipes.com/Recipe/6974/"}
{"author": "Ruth Uitto", "cook_time_minutes": 25, "description": "Light, golden loaf Swedes have served for centuries.", "error": false, "footnotes": [], "ingredients": ["5 1/2 cups all-purpose flour", "2 (.25 ounce) packages active dry yeast", "2 cups water", "1/2 cup packed brown sugar", "2 tablespoons vegetable oil", "2 teaspoons salt", "2 teaspoons orange zest", "1 1/2 teaspoons caraway seed", "1 1/2 teaspoons fennel seed", "2 eggs, room temperature", "2 cups rye flour"], "instructions": ["Boil water, sugar, oil, salt, orange rind, caraway seeds, and fennel seeds in a saucepan for 3 minutes. Cool until warm", "In a large bowl, whisk together 3 cups flour and yeast. Stir in cooled orange rind mixture. Beat with an electric mixer on medium speed for 2 minutes. Blend in eggs. Add 1 cup flour, and beat 1 minute on medium speed. Add rye flour and enough additional white flour to make a stiff dough.", "Turn dough onto a lightly floured surface. Knead for 8 to 10 minutes, or until smooth and satiny. Shape into a ball. Place in lightly greased bowl, turning to grease the surface. Cover with a damp cloth, and place in a warm spot. Allow to rise for 1 1/2 hours, or until doubled.", "Punch dough down, and divide in half. Shape into 2 balls. Let rest for 10 min. Shape into 2 loaves, and place into ungreased 9 x 5 inch loaf pans. Brush with oil. Allow to rise for 1 hour, or until doubled in size.", "Bake at 400 degrees F (205 degrees C) for 30 to 35 minutes, or until done."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/228855.jpg", "prep_time_minutes": 35, "rating_stars": 4.46, "review_count": 11, "time_scraped": 1498206934, "title": "Swedish Limpu Bread", "total_time_minutes": 240, "url": "http://allrecipes.com/Recipe/6975/"}
{"author": "Ruth", "cook_time_minutes": 30, "description": "This is a Monday Baking Day sort of recipe: it makes at least a week's worth of bread and dinner rolls.", "error": false, "footnotes": [], "ingredients": ["4 cups boiling water", "1 cup cornmeal", "2/3 cup molasses", "1/2 teaspoon baking soda", "1/2 cup margarine", "2 tablespoons salt", "4 cups cold water", "1/4 cup warm water (110 degrees F/45 degrees C)", "1 (.25 ounce) package active dry yeast", "20 1/2 cups bread flour"], "instructions": ["Place boiling water into a large mixing bowl. Stir cornmeal slowly into boiling water to make mush, stirring constantly to eliminate large lumps. Add baking soda to molasses, and beat until light and foamy. Add molasses mixture to cornmeal mixture. Mix in butter or margarine and salt. Stir in cold water to make mixture lukewarm. Dissolve yeast in 1/4 cup warm water, and add to cornmeal mixture. Gradually add flour.", "Turn dough out onto a lightly floured surface, and knead until smooth. Place in a large greased bowl. Grease the top of the dough. Cover with a damp cloth, and allow to rise until doubled.", "Punch down dough, and divide into 6 parts. Shape 4 parts into loaves, and place in 9 x 5 inch loaf pans. Use the remaining dough to make into 2 dozen rolls. Allow to rise until doubled.", "Bake at 350 degrees F (175 degrees C) for 35 to 40 minutes, or until brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/2413495.jpg", "prep_time_minutes": 40, "rating_stars": 4.0, "review_count": 2, "time_scraped": 1498206579, "title": "Hot Water Cornmeal Bread", "total_time_minutes": 160, "url": "http://allrecipes.com/Recipe/6976/"}
{"author": "Dee", "cook_time_minutes": 20, "description": "An old Southern plantation recipe.", "error": false, "footnotes": [], "ingredients": ["1/2 pound finely chopped pork", "1 teaspoon salt", "1 small onion, chopped", "1 1/2 cups cornmeal", "1/2 cup all-purpose flour", "3 teaspoons baking powder", "1/2 teaspoon baking soda", "2 eggs, beaten", "2 tablespoons honey", "1/2 cup buttermilk", "1 cup orange juice"], "instructions": ["Preheat oven to 350 degrees F (175 degree C).", "In a 10 inch oven-proof skillet, fry the pork till crisp. Add onion, and cook till just tender. Drain off liquid fat, and reserve 2 tablespoons.", "In a large mixing bowl, combine corn meal, flour, baking powder, soda, and salt. Combine eggs, honey, buttermilk, and juice: mix into cornmeal mixture. Stir in pork and onions.", "Return reserved fat to skillet, and heat till very hot. Pour batter into skillet. Transfer to oven, and bake for 30 to 35 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/665848.jpg", "prep_time_minutes": 35, "rating_stars": 4.5, "review_count": 2, "time_scraped": 1498207246, "title": "Cracklin' Bread I", "total_time_minutes": 55, "url": "http://allrecipes.com/Recipe/6977/"}
{"author": "Debbie Rowe", "cook_time_minutes": 30, "description": "This cornbread is great for those of us who eat on the go.", "error": false, "footnotes": [], "ingredients": ["1 pound pork sausage", "1 onion, chopped", "2 eggs, lightly beaten", "1 1/2 cups buttermilk self-rising cornmeal mix", "1 (15 ounce) can cream style corn", "1/2 cup sour cream", "1/4 cup vegetable oil", "2 cups shredded sharp Cheddar cheese", "1/2 cup milk"], "instructions": ["Preheat oven to 425 degrees F (220 degrees C). Grease a 10 inch ovenproof skillet.", "In a medium skillet, brown the sausage and onion; drain well.", "In a large bowl, combine eggs, corn meal mix, corn, sour cream, milk, and oil. Pour half of corn meal mixture into the greased pan, and sprinkle with sausage mixture and cheese. Pour remaining batter over top.", "Bake for 30 to 40 minutes. Let stand 10 minutes before serving."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/976523.jpg", "prep_time_minutes": 35, "rating_stars": 4.36, "review_count": 16, "time_scraped": 1498207776, "title": "Sausage Cornbread Bake", "total_time_minutes": 65, "url": "http://allrecipes.com/Recipe/6978/"}
{"author": "JACLYN", "cook_time_minutes": 30, "description": "Bread, stew and no dishes to wash after dinner!", "error": false, "footnotes": [], "ingredients": ["2 (.25 ounce) packages active dry yeast", "1 tablespoon white sugar", "1 3/4 cups warm water (110 degrees F)", "2 cups whole wheat flour", "2 cups bread flour", "2 teaspoons salt", "1 egg white", "2 tablespoons water"], "instructions": ["In a small mixing bowl, dissolve yeast and sugar in warm water. Let stand until creamy, about 10 minutes.", "In a large mixing bowl, combine the yeast mixture with the whole wheat flour, salt and one cup of the bread flour; stir well to combine. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.", "Place into a lightly oiled bowl, and turn to coat the whole surface with oil. Cover, and let rise in a warm place until doubled, about 45 minutes.", "Punch down the dough, and let rest 10 minutes. Divide into 4 balls. Place on cookie sheets, and flatten into disks. Cover and let rise until doubled, about 30 minutes. Preheat oven to 375 degrees F (190 degrees C).", "Lightly beat the egg white with the water and brush the risen loaves with this mixture. Bake at 375 degree F (190 degree C) for 40 to 50 minutes. When done bread should sound hollow when thumped on bottom. Remove from oven, and let cool.", "Cut a circle out of the top of each loaf, and remove that part of the crust. Either remove the soft bread beneath, or compress it to form a bowl."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/963859.jpg", "prep_time_minutes": 40, "rating_stars": 3.19, "review_count": 20, "time_scraped": 1498207465, "title": "Bread Bowls I", "total_time_minutes": 150, "url": "http://allrecipes.com/Recipe/6979/"}
{"author": "Dingo", "cook_time_minutes": 25, "description": "A fragrant white bread with a nice and crispy crust.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["2 tablespoons active dry yeast", "1 tablespoon white sugar", "2 cups water", "1 cup milk", "2 tablespoons margarine, softened", "6 cups bread flour", "1 tablespoon salt"], "instructions": ["In a small mixing bowl, dissolve yeast and sugar in the warm water. Let stand until creamy, about 10 minutes.", "In a large mixing bowl, combine the yeast mixture with the milk, the butter or margarine, 4 cups of the flour and the salt; stir until well combined. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.", "Lightly oil a large mixing bowl, place the dough in the bowl and turn to coat with oil. Cover with a damp cloth and put in a warm place to rise until doubled in volume, about 1 hour.", "Preheat oven to 400 degrees F (200 degrees C).", "Deflate the dough and turn it out onto a lightly floured surface. Divide the dough into two equal pieces and form into loaves. Place the loaves into two lightly greased 9x5 inch loaf pans. Cover the loaves with a damp cloth and let rise until doubled in volume, about 40 minutes.", "Mist loaves with water and bake at 400 degrees F (200 degrees C) oven for 20 to 30 minutes or until the loaves are golden brown and the bottom of a loaf sounds hollow when tapped."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/52273.jpg", "prep_time_minutes": 25, "rating_stars": 4.42, "review_count": 171, "time_scraped": 1498206231, "title": "Crusty White Bread", "total_time_minutes": 150, "url": "http://allrecipes.com/Recipe/6980/"}
{"author": "Carmela Sagendorf", "cook_time_minutes": 15, "description": "Italian fried bread dough is traditionally part of an Italian Christmas Eve celebration.", "error": false, "footnotes": ["Editor's Note:", "We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. The exact amount may vary depending on cook time and temperature, ingredient density, and the specific type of oil used."], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup warm water (110 degrees F/45 degrees C)", "1 1/2 cups all-purpose flour", "1 quart vegetable oil for frying", "2 tablespoons confectioners' sugar"], "instructions": ["Heat about 3 inches of oil in a saucepan to 375 degrees F (119 degrees C). In a large bowl, dissolve yeast in 1/2 cup warm water. Set aside for 10 minutes.", "Sir the remaining 1/2 cup water into the bowl. Add flour, beating vigorously until a soft dough forms.", "Turn the dough out onto a smooth surface, and knead with greased hands until smooth. Place dough in a greased bowl, and turn to coat the surface. Cover with a damp cloth. Let rise in a warm place until double in bulk, about 1 to 1/1/2 hours.", "Fry golf ball sizes of dough in batches until golden brown. Drain on paper towels. Sprinkle with confectioners' sugar, and eat while still hot."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4459334.jpg", "prep_time_minutes": 15, "rating_stars": 2.8, "review_count": 15, "time_scraped": 1498206944, "title": "Zeppoli", "total_time_minutes": 130, "url": "http://allrecipes.com/Recipe/6981/"}
{"author": "Jenny Kernan", "cook_time_minutes": 5, "description": "This is a great snack bread made in the bread machine. Spread with jam or honey and serve as an after school treat.  You can use your favorite style of peanut butter with this one.  My favorite is extra crunchy.", "error": false, "footnotes": [], "ingredients": ["4 cups all-purpose flour", "1 1/2 cups water", "2/3 cup peanut butter", "5 tablespoons brown sugar", "2 teaspoons salt", "3 1/2 teaspoons active dry yeast"], "instructions": ["Place ingredients in the bread machine pan in the order suggested by the manufacturer.", "This Bread can be made with the White, Rapid, or Delay bake cycles. Select one, and Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/804047.jpg", "prep_time_minutes": 180, "rating_stars": 3.92, "review_count": 31, "time_scraped": 1498205505, "title": "Peanut Butter Bread I", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/6982/"}
{"author": "Kathy", "cook_time_minutes": 10, "description": "This is a potato water starter.  It requires no addition of yeast.", "error": false, "footnotes": [], "ingredients": ["2 peeled and cubed potatoes", "2 cups warm water", "2 cups all-purpose flour", "1 teaspoon white sugar (optional)", "1 (.25 ounce) package active dry yeast"], "instructions": ["In a medium saucepan, cover potatoes with water. Cook over medium heat until tender, about 20 minutes. Remove potatoes and reserve for other use. Let cooking water cool to lukewarm.", "Mix flour and 1 cup potato water. Set aside in bowl with cloth or wax paper to cover. Mixture does not have to be mixed smooth: the batter will work out any lumps as it sits. Stir once or twice a day until it smells right. It will have a nice sourdough smell to it after about 4 or 5 days, depending on the temperature of your kitchen. You can add a teaspoon of sugar to quicken the process. If you want to speed the process even more you can add a package of yeast to the water before adding the flour. Use as directed in your favorite Sourdough Bread recipe."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/713324.jpg", "prep_time_minutes": 0, "rating_stars": 4.29, "review_count": 5, "time_scraped": 1498209447, "title": "Sourdough Starter III", "total_time_minutes": 0, "url": "http://allrecipes.com/Recipe/6985/"}
{"author": "Jenny Kernan", "cook_time_minutes": 5, "description": "This is a fragrant and tasty bread machine recipe.", "error": false, "footnotes": [], "ingredients": ["1 3/8 cups water", "3 tablespoons olive oil", "1 teaspoon minced garlic", "4 cups bread flour", "3 tablespoons white sugar", "2 teaspoons salt", "1/4 cup grated Parmesan cheese", "1 teaspoon dried basil", "1 teaspoon garlic powder", "3 tablespoons chopped fresh chives", "1 teaspoon coarsely ground black pepper", "2 1/2 teaspoons bread machine yeast"], "instructions": ["Place ingredients in the bread machine pan in the order suggested by the manufacturer.", "Select Basic or White Bread cycle, and press Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/14327.jpg", "prep_time_minutes": 180, "rating_stars": 4.22, "review_count": 117, "time_scraped": 1498200199, "title": "Garlic Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/6983/"}
{"author": "Esther Nelson", "cook_time_minutes": 10, "description": "I know, you're probably thinking, 'Oh no! Another banana bread recipe!' But this one is a little different: the sour cream makes this one so moist it melts in your mouth. The flavor is just wonderful!  This one is great for gift giving and holidays. Loaves freeze well.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1/4 cup white sugar", "1 teaspoon ground cinnamon", "3/4 cup butter", "3 cups white sugar", "3 eggs", "6 very ripe bananas, mashed", "1 (16 ounce) container sour cream", "2 teaspoons vanilla extract", "2 teaspoons ground cinnamon", "1/2 teaspoon salt", "3 teaspoons baking soda", "4 1/2 cups all-purpose flour", "1 cup chopped walnuts (optional)"], "instructions": ["Preheat oven to 300 degrees F (150 degrees C). Grease four 7x3 inch loaf pans. In a small bowl, stir together 1/4 cup white sugar and 1 teaspoon cinnamon. Dust pans lightly with cinnamon and sugar mixture.", "In a large bowl, cream butter and 3 cups sugar. Mix in eggs, mashed bananas, sour cream, vanilla and cinnamon. Mix in salt, baking soda and flour. Stir in nuts. Divide into prepared pans.", "Bake for 1 hour, until a toothpick inserted in center comes out clean."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/262277.jpg", "prep_time_minutes": 60, "rating_stars": 4.77, "review_count": 4044, "time_scraped": 1498207537, "title": "Banana Sour Cream Bread", "total_time_minutes": 70, "url": "http://allrecipes.com/Recipe/6984/"}
{"author": "Denise LaPonsie", "cook_time_minutes": 10, "description": "A very moist holiday bread that makes enough for you and gift giving as well.", "error": false, "footnotes": [], "ingredients": ["3 cups white sugar", "4 eggs", "2/3 cup water", "2 teaspoons baking soda", "1 teaspoon baking powder", "1 teaspoon ground allspice", "3 1/2 cups all-purpose flour", "2 teaspoons salt", "1 teaspoon ground nutmeg", "1 teaspoon ground cinnamon", "1/2 teaspoon ground cloves", "1 (15 ounce) can pumpkin puree", "1 cup chopped walnuts", "1 cup raisins", "1 cup vegetable oil"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour three 7 x 3 inch loaf pans.", "Mix oil, sugar, and eggs together in a large bowl. Mix in pumpkin puree and water. Stir together flour, soda, baking powder, salt, and spices. Add to the pumpkin mixture, and mix until just combined. Stir in nuts and raisins. Divide batter into prepared pans.", "Bake for 1 hour. Cool on wire racks."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1056360.jpg", "prep_time_minutes": 60, "rating_stars": 4.72, "review_count": 155, "time_scraped": 1498206141, "title": "Holiday Pumpkin Bread", "total_time_minutes": 70, "url": "http://allrecipes.com/Recipe/6986/"}
{"author": "JACLYN", "cook_time_minutes": 30, "description": "This bread takes a bit of time, but your effort is repaid with two chewy, flavorful loaves.", "error": false, "footnotes": [], "ingredients": ["1 cup rye flour", "1/2 cup bread flour", "2/3 cup water", "1/4 cup water", "1/2 tablespoon salt", "1 tablespoon white sugar", "1 tablespoon olive oil", "1 tablespoon caraway seed", "1 cup rye flour", "1 cup bread flour", "1 cup sourdough starter", "1/2 cup water (optional)", "1 teaspoon salt (optional)"], "instructions": ["The night before you want to bake the bread, feed the starter with 1 cup rye flour, 1/2 cup bread flour, and 2/3 cup water. Cover, and let stand at room temperature overnight.", "In a large bowl, mix together expanded starter, 1/4 cup water, salt, sugar, oil, seeds, and 1 cup each rye and bread flour. Add more or less flour as necessary to get a soft dough.", "Turn dough out onto a lightly floured surface, and knead until satiny. Place in a well oiled bowl, and turn once to oil the surface. Cover with a damp cloth. Allow to rise in a warm spot until doubled.", "Punch down dough, and shape into loaves. Place on a greased baking sheet. Allow to rise until doubled in bulk.", "Bake at 350 degrees F (175 degrees C) for 40 minutes, or until it sounds hollow when thumped on the bottom.", "Alternate baking method for chewier, salty crust: Bake 20 minutes at 350 degrees F (175 degrees C). In a small bowl, mix together 1/2 cup water and 1 teaspoon salt. Remove loaves from oven and brush crust with salt water. Continue baking for 25 minutes more, brushing at 10 minute intervals."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/309574.jpg", "prep_time_minutes": 40, "rating_stars": 3.9, "review_count": 26, "time_scraped": 1498206298, "title": "Sourdough Rye", "total_time_minutes": 1000, "url": "http://allrecipes.com/Recipe/6987/"}
{"author": "J.P.K.", "cook_time_minutes": 30, "description": "A beautiful loaf to see and even more wonderful to eat.", "error": false, "footnotes": ["Aluminum foil helps keep food moist, ensures it cooks evenly, keeps leftovers fresh, and makes clean-up easy."], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 3/4 cups warm milk (110 degrees F/45 degrees C)", "1 egg yolk", "2 eggs", "2 tablespoons white sugar", "2 teaspoons salt", "5 cups all-purpose flour", "1 tablespoon poppy seeds", "1 egg, beaten"], "instructions": ["In a small mixing bowl, dissolve yeast in warm milk. Let stand until creamy, about 15 minutes.", "Mix the egg, egg yolks, sugar, and salt. In a large mixing bowl, combine the yeast mixture with the egg, egg yolks, sugar, salt and 3 cups of the flour; stir until well combined. Add the remaining flour, 1/2 cup at a time, stirring well after each addition. When the dough has pulled together, turn it out onto a lightly floured surface and knead until smooth and supple, about 8 minutes.", "Turn out onto a floured bread board, and cut into 2 equal parts. Form into cylindrical loaves; let rest for 20 minutes. Divide each loaf in half and roll into a long rope for braiding. Fasten the 4 ends together. Braid. End by fastening the ends, and turning each end under the loaf. Place on cookie sheet, and cover with a towel until doubled in size, about 40 minutes.", "Brush risen loaf with a beaten egg and sprinkle with poppy seeds. Bake at 400 degrees F (200 degrees C) for 15 minutes. Reduce heat to 350 degrees F (175 degrees C) and bake for an additional 45 minutes, or until golden brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/3749.jpg", "prep_time_minutes": 60, "rating_stars": 4.63, "review_count": 38, "time_scraped": 1498207273, "title": "Hungarian Braided White Bread", "total_time_minutes": 150, "url": "http://allrecipes.com/Recipe/6988/"}
{"author": "Sarah", "cook_time_minutes": 10, "description": "This is a recipe for people who like banana bread and muffins. These are great breakfast muffins! You may substitute coconut for some or all of the walnuts if you wish.", "error": false, "footnotes": [], "ingredients": ["1 cup white sugar", "1/2 cup vegetable oil", "1 egg", "3 ripe bananas, mashed", "1/4 cup chopped walnuts", "2 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Place muffin cups in muffin tin, or grease with a little butter.", "Mix sugar, oil, and egg until creamy and light yellow in a bowl. Add bananas and walnuts. Add flour, baking soda, and salt. Stir until completely smooth. Spoon the batter into the muffin tin.", "Bake for 30 to 40 minutes, until toothpick poked in center muffin comes out clean."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4478285.jpg", "prep_time_minutes": 35, "rating_stars": 4.62, "review_count": 727, "time_scraped": 1498210732, "title": "Sarah's Banana Bread Muffins", "total_time_minutes": 45, "url": "http://allrecipes.com/Recipe/6990/"}
{"author": "Mom", "cook_time_minutes": 10, "description": "A banana muffin without the guilt.", "error": false, "footnotes": [], "ingredients": ["1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/4 teaspoon baking soda", "1/8 teaspoon salt", "2 egg whites", "1 cup mashed bananas", "3/4 cup white sugar", "3 tablespoons vegetable oil", "1 teaspoon lemon zest", "1/4 cup chopped walnuts"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Spray muffin tins with non-stick cooking spray.", "In large bowl, stir together flour, baking powder, soda, and salt.", "In a medium bowl, beat egg whites slightly. Stir in bananas, sugar, oil, and lemon peel. Add to flour mixture, stirring just until combined. Stir in walnuts. Fill muffin pan cups 2/3 full.", "Bake for about 20 to 25 minutes, or until tops are lightly browned. Remove muffins from pan."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/722631.jpg", "prep_time_minutes": 25, "rating_stars": 4.42, "review_count": 163, "time_scraped": 1498215228, "title": "Banana Nut Muffins", "total_time_minutes": 35, "url": "http://allrecipes.com/Recipe/6989/"}
{"author": "JACLYN", "cook_time_minutes": 15, "description": "Parmesan and rosemary add a delicious flavor and aroma to this soft, chewy bread.", "error": false, "footnotes": [], "ingredients": ["1 1/2 cups bread flour", "1 1/2 cups unbleached all-purpose flour", "2 teaspoons salt", "1 tablespoon white sugar", "1 (.25 ounce) package instant yeast", "1 1/3 cups warm water (110 degrees F/45 degrees C)", "3 tablespoons extra virgin olive oil, divided", "2 tablespoons chopped fresh rosemary", "2 tablespoons grated Parmesan cheese"], "instructions": ["In a large stoneware bowl, stir together the flours and salt. Make a well in the center of the flour mixture. Sprinkle the sugar and yeast into that well. Carefully pour the water into the well. Let stand until the yeast begins to act, about 5 minutes. Pour 2 tablespoons of the oil into the well. With a wooden spoon stir the mixture in the center of the bowl. Gradually widen the circle of stirring to take in all of the flour at the sides of the well.", "Turn out on a floured surface, and knead just until smooth. Keep the dough soft. Pour 1/2 teaspoon of the oil into a clean bowl. Place the dough in the bowl, turning once to oil the top. Cover. Let rise until doubled, 30 to 45 minutes.", "Punch the dough down. Use 1 teaspoon of the oil to coat a baking sheet, and place the dough on the baking sheet. Gently press the dough out to about 1/2 inch thickness. Pour the remaining 1 1/2 teaspoons oil over the top of the dough. Use the handle end of a wooden spoon to dimple the dough at 1 1/2 inch intervals. Sprinkle with the rosemary and the cheese. Place in a cold oven on the center shelf. Place a flat pan of hot water on the shelf below the bread. Let rise until doubled, 20 to 25 minutes.", "Turn on the oven to 375 degrees F (190 degrees C). Bake the focaccia for 20 to 25 minutes, or until browned on top. Remove from the pan, and cool on a wire rack. Serve warm."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/41070.jpg", "prep_time_minutes": 25, "rating_stars": 4.66, "review_count": 222, "time_scraped": 1498207484, "title": "Easy Focaccia", "total_time_minutes": 80, "url": "http://allrecipes.com/Recipe/6991/"}
{"author": "Debbie Pleau", "cook_time_minutes": 10, "description": "I got this recipe from a friend. Best if eaten warm!!!", "error": false, "footnotes": [], "ingredients": ["2 cups baking mix", "2/3 cup milk", "1/2 cup shredded Cheddar cheese", "1/4 cup Parmesan cheese", "1/4 cup butter", "1/2 teaspoon garlic powder", "1 teaspoon dried parsley"], "instructions": ["Preheat oven to 450 degrees F (230 degrees C).", "Stir together baking mix, milk and cheeses until soft dough forms. Drop by spoonfuls onto an ungreased cookie sheet.", "Bake for 10 to 12 minutes, or until bottoms are lightly browned.", "Melt butter, and stir in garlic powder and parsley flakes. Brush over warm biscuits."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/22398.jpg", "prep_time_minutes": 10, "rating_stars": 4.63, "review_count": 114, "time_scraped": 1498206738, "title": "Cheese Biscuits I", "total_time_minutes": 20, "url": "http://allrecipes.com/Recipe/6992/"}
{"author": "Cathy", "cook_time_minutes": 10, "description": "Moist and delicious. Once you make it you will always be asked for more banana bread. Just try it!", "error": false, "footnotes": ["Aluminum foil helps keep food moist, ensures it cooks evenly, keeps leftovers fresh, and makes clean-up easy."], "ingredients": ["1 cup mashed bananas", "1 cup sour cream", "1/4 cup margarine", "1 1/3 cups white sugar", "2 eggs", "1 teaspoon vanilla extract", "2 cups all-purpose flour", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/4 teaspoon salt"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour one 9x13 inch pan, or two 7x3 inch loaf pans.", "Combine banana and sour cream. Set aside. In a large bowl, cream together the margarine and sugar until smooth. Beat in the eggs one at a time, then stir in the vanilla and banana mixture. Combine the flour, baking soda, baking powder and salt; stir into the banana mixture. Spread the batter evenly into the prepared pan or pans.", "Bake for 50 minutes in the preheated oven, or until a toothpick inserted into the center of the bread comes out clean."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/378889.jpg", "prep_time_minutes": 50, "rating_stars": 4.73, "review_count": 968, "time_scraped": 1498207018, "title": "Cathy's Banana Bread", "total_time_minutes": 60, "url": "http://allrecipes.com/Recipe/6993/"}
{"author": "Karla Rossi", "cook_time_minutes": 30, "description": "This is one of our family's traditional recipes, a regional Polish sweet bread  with rice filling (From Breaking Bread: A Family History Preserved By Seven  Sisters). It makes a wonderful tea bread!", "error": false, "footnotes": [], "ingredients": ["1 (0.6 ounce) cake compressed fresh yeast", "1/4 cup warm water (110 degrees F/45 degrees C)", "1 cup milk", "1/2 cup white sugar", "1/2 cup margarine", "2 eggs", "2 teaspoons vanilla extract", "1 pinch salt", "4 1/2 cups all-purpose flour", "3/4 cup golden raisins", "1 tablespoon butter, melted", "1/2 teaspoon ground cinnamon", "1 cup white rice", "2 cups cold milk", "1 tablespoon butter", "1/4 cup white sugar", "1 pinch salt"], "instructions": ["Dissolve yeast in warm water; set aside.", "Scald 1 cup milk, and combine with 1/2 cup sugar and 1/2 cup butter or margarine. Set aside to cool.", "In a separate bowl beat eggs. Add eggs, vanilla, and pinch of salt to cooled milk mixture. Mix together. Add yeast mixture. Gradually add flour and raisins until dough comes away from the bowl. Knead the dough until pliable. Avoid handling the dough more than necessary! Place dough in a well oiled bowl. Set aside to rise until doubled in size in a draft free area.", "Combine 2 cups cold milk, 1/4 cup sugar, and pinch of salt in a saucepan. Stir in rice, and bring to a boil. Add 1 tablespoon butter. Lower heat, cover, and cook for about 20 minutes, until done. Set aside to cool.", "Punch down the dough, and knead a couple of times. Place into the center of a 9 x 14 inch casserole dish that has been sprayed with non-stick cooking spray and lightly floured. Spread dough in dish by patting gently to all sides. Let rise for 15 minutes.", "Spread rice on top of dough, and pull sides up gently to form an envelope type design. Rice will show in center. Brush the top lightly with melted butter and sprinkle with cinnamon.", "Place in a preheated 375 degree F (190 degrees C) oven. Lower temperature to 350 degrees F (175 degrees C). Bake for 30 to 40 minutes, until golden."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/8630.jpg", "prep_time_minutes": 40, "rating_stars": 4.67, "review_count": 5, "time_scraped": 1498206663, "title": "Rice Bread (Pirog)", "total_time_minutes": 160, "url": "http://allrecipes.com/Recipe/6994/"}
{"author": "Stephanie", "cook_time_minutes": 20, "description": "This is a good recipe for low-salt white bread. Each loaf should make 16 slices, 105 calories per slice. I've found that in most recipes, you can decrease the sugar by 1/3 (i.e., 3 tablespoons would now be 2 tablespoons), the salt by 2/3 (1 tablespoon would be 1 teaspoon), and replace the shortening with vegetable oil. Each rising time will be 10-15 minutes shorter.", "error": false, "footnotes": [], "ingredients": ["6 1/2 cups bread flour", "2 tablespoons white sugar", "1 teaspoon salt", "2 tablespoons vegetable oil", "2 (.25 ounce) packages active dry yeast", "2 1/4 cups warm water (110 degrees F/45 degrees C)"], "instructions": ["Mix 3-1/2 cups of the flour, the sugar, salt, oil, and yeast in large bowl. Add warm water. Beat on low speed 1 minute, scraping bowl frequently. Beat on medium speed 1 minute, scraping bowl frequently. Stir in enough remaining flour, 1 cup at a time, to make dough easy to handle.", "Turn dough onto lightly floured surface. Knead about 10 minutes or until smooth and elastic. Place in greased bowl and turn greased side up. Cover and let rise in warm place 45 to 50 minutes or until double. (Dough is ready if indentation remains when touched.) If you don't have a warm, draft-free place, I find it works well to place covered bowl on a rack in the oven above a pan of warm water.", "Grease 2 loaf pans, 9x5x3 or 8-1/2x4-1/2x2-1/2 inches. Punch down dough and divide in half. Shape each half into loaf, place in pans. Brush loaves lightly with margarine if desired. Cover and let rise in warm place 35 to 40 minutes or until double.", "Place oven rack in low position so that tops of pans will be in center of oven. Heat oven to 425 degrees F (220 degrees C). Bake 25 to 30 minutes or until loaves are deep golden brown and sound hollow when tapped; remove from pans. Brush loaves with margarine if desired. Cool on wire rack."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4005351.jpg", "prep_time_minutes": 30, "rating_stars": 4.2, "review_count": 5, "time_scraped": 1498207548, "title": "Low-Salt White Bread", "total_time_minutes": 140, "url": "http://allrecipes.com/Recipe/6997/"}
{"author": "Marilou Hitt", "cook_time_minutes": 30, "description": "This makes a very large and impressive loaf. I have used it for large parties.", "error": false, "footnotes": [], "ingredients": ["2 (.25 ounce) packages active dry yeast", "1/2 cup warm water (110 degrees F/45 degrees C)", "2 cups hot milk", "1/2 cup white sugar", "1/2 cup butter", "2 teaspoons salt", "1/2 cup water", "5 eggs", "11 cups all-purpose flour", "1 egg", "2 tablespoons sesame seeds"], "instructions": ["Proof yeast and 1/2 cup warm water in a large mixing bowl.", "Combine hot milk, sugar, butter, salt, and 1/2 cup water in a medium bowl. Cool to 110 degrees.", "In small bowl, slightly beat 5 eggs, then add to cooled milk mixture. Add milk mixture to yeast mixture. Add 2 cups flour and beat until smooth. Slowly add remaining flour until it forms a stiff dough. Knead on a floured board for 10 minutes (5 minutes with a bread hook). Place in a large glass or plastic bowl lightly greased. Turn dough over to grease both sides. Cover and let rise in a warm, dark place until doubled in volume, approximately 60 minutes.", "Punch down, cover, and let rise again until double, approximately 30 minutes.", "Punch again, and form into three parts. Form each part into a 20-inch roll. Braid rolls on a large, greased cookie sheet. Cover and let rise until doubled.", "Lightly beat remaining egg and brush loaf. Sprinkle with sesame seeds. Bake in preheated 350 degree F (175 degrees C) oven for about 55 minutes until nicely browned. May be made into two regular sized loaves. Reduce baking time slightly."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1120798.jpg", "prep_time_minutes": 55, "rating_stars": 4.75, "review_count": 114, "time_scraped": 1498207330, "title": "Braided Egg Bread", "total_time_minutes": 205, "url": "http://allrecipes.com/Recipe/6995/"}
{"author": "Stephanie Knewasser", "cook_time_minutes": 20, "description": "These are gobbled up as soon as family sees them. I'll never try another cinnamon roll recipe, because I think these are the best. Note: These are wonderful fresh, but they don't freeze well.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1/2 cup milk", "1/2 cup water", "2 tablespoons butter", "3/4 teaspoon salt", "3 cups all-purpose flour", "2 1/4 teaspoons active dry yeast", "1/4 cup white sugar", "1 egg", "3 tablespoons softened butter", "3/4 teaspoon ground cinnamon", "1/3 cup white sugar", "1/3 cup raisins (optional)", "1/3 cup chopped walnuts (optional)", "1 cup confectioners' sugar", "1 1/2 tablespoons melted butter", "1/4 teaspoon vanilla extract", "1 1/2 tablespoons milk"], "instructions": ["In saucepan, heat 1/2 cup milk, water, and 2 tablespoons butter until very warm. Place milk mixture, salt, flour, yeast, sugar, and eggs in the pan of the bread machine in the order suggested by the manufacturer. Select the Dough cycle. Press Start.", "Once Dough cycle is complete, remove the dough from the bread machine and punch down. On a floured surface, roll into a large rectangle. Smear with the softened butter. Combine the cinnamon and 1/3 cup sugar. Sprinkle over the rectangle. Generously sprinkle the raisins and/or chopped nuts over the top.", "Roll the dough up into a log starting at the long side. Cut into 12 slices. Place the rolls cut side down into a 9x13-inch greased baking pan. Cover, and let rise in a warm place until almost doubled, about 30 minutes.", "Preheat an oven to 375 degrees F (190 degrees C). Combine the confectioners' sugar, 1.5 tablespoons melted butter, vanilla extract, and 1.5 tablespoons milk into a thick frosting; set aside.", "Bake rolls in preheated oven until golden, 20 to 25 minutes. Remove and allow to cool 10 minutes. Spread frosting over baked rolls and enjoy."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/24056.jpg", "prep_time_minutes": 25, "rating_stars": 4.55, "review_count": 379, "time_scraped": 1498207861, "title": "Cinnamon Rolls II", "total_time_minutes": 210, "url": "http://allrecipes.com/Recipe/6996/"}
{"author": "Katy", "cook_time_minutes": 20, "description": "Pumpkin Rolls perfect for Thanksgiving!", "error": false, "footnotes": [], "ingredients": ["2 (.25 ounce) packages active dry yeast", "1 1/2 cups warm water (110 degrees F/45 degrees C)", "1/3 cup brown sugar", "2 teaspoons salt", "2 eggs", "1/2 cup melted butter", "1 cup canned pumpkin", "7 cups all-purpose flour", "1/4 cup butter, softened (optional)"], "instructions": ["Dissolve yeast in warm water and stir in sugar, salt, 1/2 cup butter, pumpkin and eggs. Add 3 cups of the flour and beat well. Stir in enough additional flour to make dough easy to handle. Knead on lightly floured surface until smooth and elastic. Place in greased bowl, covered, and allow to double in size.", "Punch down, and divide into 4 parts, rolling each into a 12-inch circle. Spread with 1/4 cup butter if desired. Cut into 8 wedges. Roll up each wedge beginning at wide edge. Place on greased sheet and allow to rise.", "Bake at 375 degrees F (190 degrees C) for 15-20 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/44698.jpg", "prep_time_minutes": 20, "rating_stars": 4.24, "review_count": 30, "time_scraped": 1498205342, "title": "Pumpkin Rolls I", "total_time_minutes": 130, "url": "http://allrecipes.com/Recipe/6998/"}
{"author": "Helen Hanson", "cook_time_minutes": 20, "description": "Bulk mix suitable for quick breads and/or muffins. These are great baked in mini pans for an assortment on trays for gifts. I also bake a lot for fall bake sales. Three cups of mix makes one large or two medium loaves. Add 1 cup pureed cooked vegetable or fruit such as pumpkin, winter squash, carrots, apricots, applesauce, mashed banana along with whatever nuts, fruits or flavorings you desire.", "error": false, "footnotes": [], "ingredients": ["12 cups all-purpose flour", "6 cups white sugar", "12 teaspoons baking powder", "6 teaspoons baking soda", "6 teaspoons salt", "1/2 cup vegetable oil", "2 eggs"], "instructions": ["Mix thoroughly flour, sugar, baking powder, soda, and salt. (Can be stored on the shelf for months.)", "Mix 3 cups baking mix, oil, eggs, and 1 cup vegetables or fruits. Add flavorings, nuts, raisins, dates, etc., if desired. Pour into one 8-1/2x4-1/2 inch or two 7-1/4x3-1/2 inch greased loaf pans.", "Bake at 350 degrees F (175 degrees C) for 30 to 45 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/482975.jpg", "prep_time_minutes": 45, "rating_stars": 3.93, "review_count": 49, "time_scraped": 1498208266, "title": "Quick Bread Mix", "total_time_minutes": 65, "url": "http://allrecipes.com/Recipe/6999/"}
{"author": "Mike A.", "cook_time_minutes": 25, "description": "This is a great recipe for sweet, fluffy crescent rolls (kind of like a croissant but more dense).", "error": false, "footnotes": ["Aluminum foil helps keep food moist, ensures it cooks evenly, keeps leftovers fresh, and makes clean-up easy."], "ingredients": ["2 (.25 ounce) packages active dry yeast", "3/4 cup warm water (110 degrees F/45 degrees C)", "1/2 cup white sugar", "1 teaspoon salt", "2 eggs", "1/2 cup butter, room temperature", "4 cups all-purpose flour", "1/4 cup butter, softened"], "instructions": ["Dissolve yeast in warm water.", "Stir in sugar, salt, eggs, butter, and 2 cups of flour. Beat until smooth. Mix in remaining flour until smooth. Scrape dough from side of bowl. Knead dough, then cover it and let rise in a warm place until double (about 1 1/2 hours).", "Punch down dough. Divide in half. Roll each half into a 12-inch circle. Spread with butter. Cut into 10 to 15 wedge. Roll up the wedges starting with the wide end. Place rolls with point under on a greased baking sheet. Cover and let rise until double (about 1 hour).", "Bake at 400 degrees F (205 degrees C) for 12-15 minute or until golden brown. Brush tops with butter when they come out of the oven."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/345237.jpg", "prep_time_minutes": 15, "rating_stars": 4.59, "review_count": 282, "time_scraped": 1498207051, "title": "Golden Crescent Rolls", "total_time_minutes": 190, "url": "http://allrecipes.com/Recipe/7000/"}
{"author": "Christina Jun", "cook_time_minutes": 15, "description": "This recipe was given to my mom from our neighbor. The bread is so sweet and delicious!  It's still very scrumptious if you choose not to use the glaze. They are the BEST GUARANTEED!", "error": false, "footnotes": [], "ingredients": ["3 cups all-purpose flour", "1 1/2 teaspoons salt", "1 1/2 teaspoons baking powder", "3 tablespoons poppy seeds", "1 1/2 teaspoons butter flavored extract", "1 1/3 cups vegetable oil", "3 eggs", "1 1/2 cups milk", "2 1/4 cups white sugar", "1 1/2 teaspoons vanilla extract", "1 1/2 teaspoons almond extract", "1/4 cup orange juice", "1/2 teaspoon butter flavored extract", "1/2 teaspoon almond extract", "1 teaspoon vanilla extract", "2 cups confectioners' sugar"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease bottoms of two 9-inch loaf pans.", "Mix together flour, salt, baking powder, poppy seeds, butter flavoring, oil, eggs, milk, sugar, vanilla, and almond flavoring. Pour into prepared pans.", "Bake at 350 degrees F (175 degrees C) for one hour. Cool 5 minutes. Poke holes in top of loaves and pour glaze over.", "To make glaze: Mix orange juice, 1/2 teaspoon butter flavoring, 1/2 teaspoon almond flavoring, and 1 teaspoon vanilla. Add enough confectioners' sugar to make glaze."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/34726.jpg", "prep_time_minutes": 60, "rating_stars": 4.79, "review_count": 130, "time_scraped": 1498206705, "title": "Poppy Seed Bread with Glaze", "total_time_minutes": 80, "url": "http://allrecipes.com/Recipe/7001/"}
{"author": "Carol Ponec-Nemec", "cook_time_minutes": 60, "description": "Traditional Czechoslovakian Christmas Bread. Serve with butter. Some people toast it, use jelly, or even butter and powdered sugar...depending upon local customs and family preference. It is a day-long project, but well worth the effort.", "error": false, "footnotes": [], "ingredients": ["1 (0.6 ounce) cake compressed fresh yeast", "1/4 cup warm water (110 degrees F/45 degrees C)", "1/2 cup white sugar", "1/2 cup butter", "1 egg, beaten", "1 teaspoon salt", "2 cups scalded milk", "6 cups all-purpose flour", "1 pinch ground ginger", "1 pinch ground mace", "1/4 teaspoon orange zest", "1/2 cup golden raisins", "1/2 cup candied mixed fruit peel", "1/2 cup blanched slivered almonds", "1 egg yolk", "1 tablespoon milk", "2 tablespoons confectioners' sugar"], "instructions": ["Dissolve yeast in warm water.", "In a large bowl, cream sugar and butter. Add beaten egg and salt. Stir in cooled milk and then the yeast. Add 1 1/2 cups sifted flour; beat into a smooth batter. Cover and let rise until light, about one hour.", "Stir spices and dried orange zest into the sponge. Add 4 1/2 cups of flour to make a soft dough. Place on a lightly floured board, and knead until smooth and elastic. Knead in raisins and candied peel. Put in a well oiled bowl, and turn once to coat the surface of the dough. Cover. Set aside to rise until double in bulk, about 2 hours.", "Divide dough into ten parts, roll into desired lengths, and let rise about 15 minutes.", "On a heavily greased baking sheet, make a braid of three parts, beginning in the center and working braid loosely toward each end. Pinch ends together. Twist the remaining two pieces together, and place on the base of the braid. In a small bowl, beat together egg yolk and milk; brush the loaf with this mixture. Sprinkle sliced almonds over the loaf. Repeat process for second loaf. Let rise about 45 minutes.", "Bake at 350 degrees F (175 degrees C) for 45 minutes. Transfer bread to a wire rack, and cool completely. Cover while cooling with a tea towel to make a soft crust. Sprinkle with confectioners' sugar."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/52856.jpg", "prep_time_minutes": 45, "rating_stars": 4.74, "review_count": 11, "time_scraped": 1498207363, "title": "Czech Christmas Hoska", "total_time_minutes": 330, "url": "http://allrecipes.com/Recipe/7002/"}
{"author": "GAF55", "cook_time_minutes": 10, "description": "This is a really good and moist bread.", "error": false, "footnotes": [], "ingredients": ["3 cups all-purpose flour", "3 eggs", "2 cups white sugar", "1 cup vegetable oil", "2 cups applesauce", "1 cup raisins (optional)", "1 teaspoon ground cinnamon", "1 teaspoon baking soda", "1/4 teaspoon baking powder", "1/2 cup sour cream"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 9 x 5 inch loaf pans.", "Beat together eggs, sugar, and oil. Blend in applesauce, and then sour cream or buttermilk. Mix in flour, baking powder, soda, and cinnamon. Stir in raisins. Pour batter into prepared pans.", "Bake for 80 minutes. Cool on wire racks."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4373384.jpg", "prep_time_minutes": 80, "rating_stars": 4.39, "review_count": 122, "time_scraped": 1498207894, "title": "Applesauce Bread I", "total_time_minutes": 90, "url": "http://allrecipes.com/Recipe/7003/"}
{"author": "Tina", "cook_time_minutes": 30, "description": "This is a very good bread to have with baked beans, or just on it's own.  This recipe can also be used to make rolls.", "error": false, "footnotes": [], "ingredients": ["2 cups boiling water", "1 cup rolled oats", "2 tablespoons shortening", "3 tablespoons brown sugar", "4 teaspoons salt", "1 cup molasses", "1/2 cup warm water (110 degrees F/45 degrees C)", "1 teaspoon white sugar", "2 tablespoons active dry yeast", "3 cups warm water (110 degrees F/45 degrees C)", "12 cups bread flour", "1 1/2 cups raisins", "1 1/2 teaspoons ground cinnamon"], "instructions": ["Combine boiling water, oats, shortening, brown sugar, salt, and molasses. Allow to cool.", "Stir 1/2 cup warm water and 1 teaspoon white sugar until sugar is dissolved. Sprinkle yeast over this mixture, and proof while oats are cooling.", "Add 3 cups of warm water to the cooled oat mixture. Stir in yeast. Begin stirring in flour 1 cup at a time until it begins to get hard to stir. Dredge raisins in flour, and mix with cinnamon; mix into the dough. Turn onto a lightly floured surface, and knead in enough flour to make a soft but not sticky dough. Cover. Let rise for 1 to 2 hours in a warm place, or until dough doubles in size.", "Divide dough into 5 parts. Shape loaves, and place into greased 9 x 5 inch loaf pans.", "Bake in a preheated 375 degree F (190 degree C) oven for 20 minutes. Reduce heat to 350 degrees F (175 degrees C), and bake an additional 20 minutes. Cool on wire racks."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4507370.jpg", "prep_time_minutes": 40, "rating_stars": 4.29, "review_count": 5, "time_scraped": 1498207581, "title": "Raisin Brown Bread", "total_time_minutes": 190, "url": "http://allrecipes.com/Recipe/7004/"}
{"author": "Helen Hanson", "cook_time_minutes": 15, "description": "Quick and easy rolled oat bread.", "error": false, "footnotes": [], "ingredients": ["1 1/2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1/2 teaspoon baking soda", "1 1/2 teaspoons ground cinnamon", "1 cup quick cooking oats", "3/4 cup packed brown sugar", "3/4 cup raisins", "1 1/4 cups applesauce", "1/3 cup vegetable oil", "2 eggs, beaten", "1/4 cup milk", "1/4 cup apple juice"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8 1/2 x 4 1/2 inch loaf pan.", "Soak raisins in apple juice.", "In a large bowl, whisk together flour, baking powder, soda, cinnamon, oats, and brown sugar. Add applesauce, oil, eggs, and milk; stir until just combined. Mix in raisins. Spread batter into prepared pan.", "Bake for 55 to 60 minutes. Remove from pan immediately, and cool on a wire rack."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/529769.jpg", "prep_time_minutes": 60, "rating_stars": 4.21, "review_count": 31, "time_scraped": 1498205375, "title": "Applesauce Raisin Bread", "total_time_minutes": 75, "url": "http://allrecipes.com/Recipe/7005/"}
{"author": "Helen Hanson", "cook_time_minutes": 15, "description": "A yummy fruit and nut filled oat bread.  I also like to use 3 mashed bananas in place of the apples, and sometimes use some of each.", "error": false, "footnotes": [], "ingredients": ["1 1/2 cups all-purpose flour", "2 teaspoons baking powder", "1/4 teaspoon baking soda", "1 teaspoon salt", "1 1/4 teaspoons ground cinnamon", "1/4 teaspoon ground nutmeg", "2/3 cup packed brown sugar", "1 cup rolled oats", "1 1/2 cups grated apple", "1/4 cup chopped walnuts", "1/4 cup raisins", "2 eggs", "1/4 cup milk", "1/4 cup vegetable oil"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour an 8 1/2 x 4 1/2 inch loaf pan.", "In a large bowl, combine flour, baking powder, baking soda, salt, cinnamon, nutmeg, brown sugar, and oats. Add apple, nuts, raisins, eggs, milk, and oil. Mix until dry ingredients are moistened.", "Bake for 55 to 60 minutes, or until done. Cool on wire rack."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/21563.jpg", "prep_time_minutes": 60, "rating_stars": 4.15, "review_count": 37, "time_scraped": 1498208299, "title": "Apple Raisin Bread", "total_time_minutes": 75, "url": "http://allrecipes.com/Recipe/7006/"}
{"author": "Helen Hanson", "cook_time_minutes": 10, "description": "Moist bread. Good as written but even better with the addition of raisins, nuts, and spices.", "error": false, "footnotes": [], "ingredients": ["1 cup rolled oats", "1 cup buttermilk", "1/2 cup vegetable oil", "1 egg", "1/2 cup packed brown sugar", "1 cup all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon salt"], "instructions": ["Mix oats with buttermilk. Let stand for 1/2 hour.", "Stir oil, egg, and brown sugar into oat mixture. Stir together flour, baking powder, soda, and salt: mix into oat mixture. Pour batter into a greased and floured 8 1/2 x 4 1/2 inch loaf pan.", "Bake at 350 degrees F (175 degrees C) for 55 to 60 minutes, or until done."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/17406.jpg", "prep_time_minutes": 60, "rating_stars": 4.15, "review_count": 38, "time_scraped": 1498206484, "title": "Buttermilk Oatmeal Bread", "total_time_minutes": 100, "url": "http://allrecipes.com/Recipe/7007/"}
{"author": "Nan", "cook_time_minutes": 30, "description": "One of our Christmas breakfast traditions - we make cherry, apricot and blueberry.", "error": false, "footnotes": [], "ingredients": ["1 cup shortening", "1/2 cup white sugar", "1 1/2 teaspoons salt", "2 1/2 cups scalded milk", "4 egg yolks, beaten", "1/2 teaspoon lemon extract", "1 1/2 tablespoons active dry yeast", "5 cups all-purpose flour", "1/2 cup fruit preserves"], "instructions": ["Cream shortening and sugar together. Stir in salt, hot milk, beaten egg yolks, and flavoring. When lukewarm, add yeast to mixture. Let stand 5 minutes. Add flour, beating well. Knead down into bowl. The dough will be slightly sticky. Let rise 1 hour.", "Cut off small balls of dough. Roll into rounds in your hands, and place on greased cookie sheets 2 inches apart. Let rise 15 minutes.", "Make a depression into the center of each roll. Fill with fruit preserves.", "Bake at 450 degrees F (230 degrees C) until brown. Watch carefully. Cool on wire racks."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/943400.jpg", "prep_time_minutes": 20, "rating_stars": 4.44, "review_count": 26, "time_scraped": 1498206158, "title": "Kolaches II", "total_time_minutes": 125, "url": "http://allrecipes.com/Recipe/7008/"}
{"author": "Ruth Uitto", "cook_time_minutes": 20, "description": "Slightly sweet whole wheat bread.  Use stone ground flour if available. This is a very big recipe, you may want to divide it in half.", "error": false, "footnotes": [], "ingredients": ["1/3 cup shortening", "1 cup hot water", "1 cup packed brown sugar", "3 (.25 ounce) packages active dry yeast", "4 cups warm water (110 degrees F/45 degrees C)", "4 tablespoons white sugar", "4 teaspoons salt", "6 cups bread flour", "6 cups whole wheat flour"], "instructions": ["Dissolve brown sugar in 1 cup hot water. Add shortening, and stir to melt. Let cool.", "In a large bowl, dissolve yeast in 4 cups warm water. Add white sugar, salt, and bread flour. Beat well. Stir in shortening mixture. Stir in enough whole wheat flour to make a stiff but not dry dough.", "Turn out onto a lightly floured surface. Knead until smooth and elastic. Place in a large, well oiled bowl. Cover, and allow to rise until dough doubles in bulk.", "Divide dough into four equal parts. Shape into loaves. Place in greased, 9 x 5 inch pans, turning each loaf over in pan to grease top. Allow to rise until dough doubles in bulk.", "Bake at 350 degrees F (175 degrees C) for 35 minutes. Let cool before slicing."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4478014.jpg", "prep_time_minutes": 35, "rating_stars": 4.71, "review_count": 89, "time_scraped": 1498206447, "title": "Whole Wheat Bread II", "total_time_minutes": 145, "url": "http://allrecipes.com/Recipe/7009/"}
{"author": "Kim B.", "cook_time_minutes": 30, "description": "A unique bread with a sweet flavor that makes a wonderful holiday gift!  It takes about 4 hours to make, so allow yourself plenty of time.", "error": false, "footnotes": [], "ingredients": ["2 cups milk", "1/2 cup warm water (110 degrees F/45 degrees C)", "1 (.25 ounce) package active dry yeast", "1 cup white sugar", "1 teaspoon salt", "1 teaspoon ground cardamom", "4 eggs, beaten", "9 cups all-purpose flour", "1/2 cup butter, melted", "1 egg, beaten", "2 tablespoons white sugar"], "instructions": ["Warm the milk in a small saucepan until it bubbles, then remove from heat. Let cool until lukewarm.", "Dissolve the yeast in the warm water. Stir in the lukewarm milk, sugar, salt, cardamom, 4 eggs, and enough flour to make a batter (approximately 2 cups). Beat until the dough is smooth and elastic. Add about 3 cups of the flour and beat well; the dough should be smooth and glossy in appearance. Add the melted butter or margarine, and stir well. Beat again until the dough looks glossy. Stir in the remaining flour until the dough is stiff.", "Turn out of bowl onto a floured surface, cover with an inverted mixing bowl, and let rest for 15 minutes. Knead the dough until smooth and satiny. Place in a lightly greased mixing bowl, and turn the dough to grease the top. Cover with a clean dishtowel. Let rise in a warm place until doubled in bulk, about 1 hour. Punch down, and let rise again until almost doubled.", "Turn out again on to a floured surface, and divide into 3 parts. Divide each third into 3 again. Roll each piece into a 12 to 16 inch strip. Braid 3 strips into a loaf. You should get 3 large braided loaves. Lift the braids onto greased baking sheets. Let rise for 20 minutes.", "Brush each loaf with egg wash and sprinkle with sugar.", "Bake at 400 degrees F (205 degrees C) for 25 to 30 minutes. Check occasionally because the bottom burns easily."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/8008.jpg", "prep_time_minutes": 30, "rating_stars": 4.79, "review_count": 143, "time_scraped": 1498209564, "title": "Finnish Pulla", "total_time_minutes": 200, "url": "http://allrecipes.com/Recipe/7010/"}
{"author": "Carol chi-wa Chung", "cook_time_minutes": 30, "description": "Here's some yummy, Chinese dim sum you can make, either plain without meat fillings, or with meat fillings. A wok equipped with a stainless steel steam plate, a plate with holes to allow steam to pass, is required to make these tasty buns. You may use milk in place of the warm water if you wish.", "error": false, "footnotes": [], "ingredients": ["1 tablespoon active dry yeast", "1 teaspoon white sugar", "1/4 cup all-purpose flour", "1/4 cup water", "1/2 cup warm water", "1 1/2 cups all-purpose flour", "1/4 teaspoon salt", "2 tablespoons white sugar", "1 tablespoon vegetable oil", "1/2 teaspoon baking powder"], "instructions": ["Mix together yeast, 1 teaspoon sugar, 1/4 cup flour, and 1/4 cup warm water. Allow to stand for 30 minutes.", "Mix in 1/2 cup warm water, flour, salt, 2 tablespoons sugar, and vegetable oil. Knead until dough surface is smooth and elastic. Roll over in a greased bowl, and let stand until triple in size, about 2 1/2 to 3 hours.", "Punch down dough, and spread out on a floured board. Sprinkle baking powder evenly on surface, and knead for 5 minutes. Divide dough into 2 parts, and place the piece you are not working with in a covered bowl. Divide each half into 12 parts. Shape each part into a ball with smooth surface up. Put each ball on a wax paper square. Let stand covered until double, about 30 minutes.", "Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling. Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns. At least 2 inches space should be left between steam-plate and the wok. Cover wok with lid. Steam buns over boiling water for 15 minutes.", "REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/231107.jpg", "prep_time_minutes": 30, "rating_stars": 4.39, "review_count": 136, "time_scraped": 1498206264, "title": "Chinese Steamed Buns", "total_time_minutes": 240, "url": "http://allrecipes.com/Recipe/7011/"}
{"author": "Kathy Nowell", "cook_time_minutes": 5, "description": "Has a texture like angel food cake.", "error": false, "footnotes": [], "ingredients": ["3/4 cup warm water (110 degrees F/45 degrees C)", "1 cup cottage cheese, room temperature", "2 tablespoons vegetable oil", "1 egg", "3 cups all-purpose flour", "2 tablespoons white sugar", "1/4 teaspoon baking soda", "1 teaspoon salt", "1 3/4 teaspoons active dry yeast"], "instructions": ["Add the ingredients to the pan of your bread machine in the order suggested by the manufacturer, and Start. You can use more bread flour if the dough seems too sticky."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/3129162.jpg", "prep_time_minutes": 180, "rating_stars": 4.25, "review_count": 27, "time_scraped": 1498206415, "title": "Cottage Cheese Bread II", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7012/"}
{"author": "Shelley Ross", "cook_time_minutes": 10, "description": "This recipe was shared with me by my friend, Sharon. She was given the recipe by her mother. Everyone who has tasted them will agree that they are the best muffins ever!", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 cup margarine", "1 1/4 cups white sugar", "1 egg", "3 ripe bananas", "1 tablespoon instant coffee granules, dissolved in", "1 tablespoon water", "1 teaspoon vanilla extract", "2 1/4 cups all-purpose flour", "1/4 teaspoon salt", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 cup semisweet chocolate chips"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Blend butter or margarine, sugar, egg, banana, dissolved coffee, and vanilla in food processor for 2 minutes. Add flour, salt, baking powder, and soda, and blend just until flour disappears. Add chocolate chips and mix in with wooden spoon. Spoon mixture into 15 to 18 paper-lined muffin cups.", "Bake for 25 minutes. Cool on wire racks."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1334257.jpg", "prep_time_minutes": 25, "rating_stars": 4.66, "review_count": 561, "time_scraped": 1498207389, "title": "Mocha Chocolate Chip Banana Muffins", "total_time_minutes": 35, "url": "http://allrecipes.com/Recipe/7013/"}
{"author": "Mitzi Lyons", "cook_time_minutes": 10, "description": "This cornbread is considered a favorite in our family. It was given to me by my mother-in-law. It is a very thick and hearty cornbread and goes well with most anything. You can also add tomatoes and ground beef.", "error": false, "footnotes": [], "ingredients": ["1 cup cornmeal", "1 cup milk", "3 eggs", "1/2 cup chopped green bell pepper", "1/2 cup chopped onion", "1 teaspoon garlic powder", "1/2 teaspoon salt", "1/2 teaspoon baking soda", "1/2 teaspoon white sugar", "1 (8.75 ounce) can whole kernel corn, drained", "1 (4 ounce) jar diced pimento peppers, drained", "1/2 cup vegetable oil", "2 teaspoons chopped jalapeno peppers"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C).", "Combine the cornmeal, milk, oil, eggs, chopped green bell pepper, chopped onion, garlic powder, salt, baking soda, sugar, drained corn kernels, pimentos and jalapeno peppers. Mix until combined, and pour into a well greased 10 to 14 inch cast iron skillet.", "Bake for 45 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/51489.jpg", "prep_time_minutes": 45, "rating_stars": 3.5, "review_count": 4, "time_scraped": 1498215395, "title": "Ruby's Special Cornbread", "total_time_minutes": 55, "url": "http://allrecipes.com/Recipe/7014/"}
{"author": "Jan Bittner", "cook_time_minutes": 10, "description": "Delicious, light muffins with real maple syrup.", "error": false, "footnotes": [], "ingredients": ["1 1/2 cups all-purpose flour", "1/4 cup white sugar", "2 teaspoons baking powder", "1/2 teaspoon salt", "1/4 cup shortening", "1/4 cup rolled oats", "1 egg, beaten", "1/2 cup milk", "1/2 cup real maple syrup"], "instructions": ["Preheat oven to 400 degrees F (205 degrees C). Grease the cups of a 12-cup muffin pan.", "Sift together flour, sugar, baking powder and salt. Cut in shortening until mixture resembles coarse crumbs. Stir in oats. Add egg, milk, and syrup. Stir only until dry ingredients are moistened. Fill greased muffin tins 3/4 full.", "Bake for 18 to 20 minutes. Remove from oven, and let stand a few minutes before removing muffins from the pan."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/3630728.jpg", "prep_time_minutes": 20, "rating_stars": 3.89, "review_count": 43, "time_scraped": 1498206008, "title": "Maple Muffins", "total_time_minutes": 30, "url": "http://allrecipes.com/Recipe/7015/"}
{"author": "Jan Bittner", "cook_time_minutes": 5, "description": "There are many, fancy variations on this basic recipe.  This recipe works with many types of bread - white, whole wheat, cinnamon-raisin, Italian or French. Serve hot with butter or margarine and maple syrup.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["6 thick slices bread", "2 eggs", "2/3 cup milk", "1/4 teaspoon ground cinnamon (optional)", "1/4 teaspoon ground nutmeg (optional)", "1 teaspoon vanilla extract (optional)", "salt to taste"], "instructions": ["Beat together egg, milk, salt, desired spices and vanilla.", "Heat a lightly oiled griddle or skillet over medium-high heat.", "Dunk each slice of bread in egg mixture, soaking both sides. Place in pan, and cook on both sides until golden. Serve hot."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/234562.jpg", "prep_time_minutes": 15, "rating_stars": 4.54, "review_count": 1002, "time_scraped": 1498208037, "title": "French Toast I", "total_time_minutes": 20, "url": "http://allrecipes.com/Recipe/7016/"}
{"author": "Laura Owen", "cook_time_minutes": 10, "description": "I make this delicious French toast on snow days.  I use cinnamon-raisin English muffins rather than bread, with great results. Serve with warm maple syrup.", "error": false, "footnotes": [], "ingredients": ["2 eggs", "1/2 cup milk", "1/4 teaspoon salt", "1/2 teaspoon ground nutmeg", "6 slices raisin bread", "2 tablespoons butter", "1 cup white sugar"], "instructions": ["Mix eggs, milk, salt, and nutmeg together with a fork, until the whole mixture is pale yellow. Pour this into a low, flat pan or a large, shallow dish.", "If you are using English muffins, cut them in half so that you have six halves. Let the halves or the slices of bread soak on each side in the egg mixture. Spread a layer of granulated sugar on a plate, and dip both sides of the bread in sugar.", "Heat a griddle or skillet over medium heat. Put about half a tablespoon of butter in the pan, and let it melt. Place two muffin halves or slices of bread in the pan. Cook for 2 to 3 minutes on each side. Wipe old butter out of pan, and repeat with remaining slices of bread."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/721481.jpg", "prep_time_minutes": 20, "rating_stars": 3.75, "review_count": 11, "time_scraped": 1498206229, "title": "Snow Day French Toast", "total_time_minutes": 30, "url": "http://allrecipes.com/Recipe/7017/"}
{"author": "Karin Christian", "cook_time_minutes": 35, "description": "These are a delicious cross between a roll and a biscuit. You roll them out like a biscuit, and they rise like a roll.", "error": false, "footnotes": [], "ingredients": ["1 (.25 ounce) package active dry yeast", "1/4 cup warm water (110 degrees F/45 degrees C)", "2 cups buttermilk", "5 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon baking soda", "2 teaspoons salt", "3 tablespoons white sugar", "3/4 cup shortening"], "instructions": ["In a small bowl, dissolve yeast in warm water. Let stand until creamy, about 5 minutes. Add buttermilk to yeast mixture, and set aside.", "In a large bowl, combine flour, sugar, baking powder, baking soda, and salt. Cut in shortening with a pastry blender until mixture resembles coarse meal. Stir in yeast mixture until dry ingredients are moistened. Turn dough out onto a floured surface, and knead 4 or 5 times.", "On a lightly floured surface, roll dough to 1/2 inch thickness. Cut out biscuits with a 2 1/2 inch round cutter. Place on lightly greased baking sheets, barely touching each other. Cover, and let rise in a warm place free from drafts for 1 hour, or until almost doubled in size. Preheat oven to 425 degrees F (220 degrees C).", "Bake in preheated oven for 10 to 12 minutes, or until browned."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/45561.jpg", "prep_time_minutes": 10, "rating_stars": 4.53, "review_count": 151, "time_scraped": 1498205132, "title": "Angel Biscuits II", "total_time_minutes": 105, "url": "http://allrecipes.com/Recipe/7018/"}
{"author": "LITSTER5", "cook_time_minutes": 10, "description": "These muffins are a chocolatey treat thanks to the double chocolate punch of cocoa powder and chocolate chips.", "error": false, "footnotes": [], "ingredients": ["1/2 cup applesauce", "1/4 cup margarine, softened", "1/2 cup white sugar", "1/2 cup light brown sugar", "1 egg", "1/2 teaspoon vanilla extract", "1 cup all-purpose flour", "1/4 cup unsweetened cocoa powder", "1/2 teaspoon baking soda", "1/4 teaspoon ground cinnamon (optional)", "1 cup semi-sweet chocolate chips", "2 tablespoons confectioners' sugar (optional)"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Line muffin cups (2-1/2 inches in diameter) with paper bake cups.", "In large mixer bowl, beat butter, sugar, brown sugar, egg, and vanilla until well blended. Add applesauce, blend well.", "In a separate bowl, stir together flour, cocoa, baking soda, and cinnamon, if desired. Add to butter mixture, blending well. Stir in chocolate chips. Fill muffin cups 3/4 full with batter.", "Bake at 350 degrees F (175 degrees C) for 22 to 26 minutes or until wooden pick inserted in center comes out almost clean. Cool slightly in pan on wire rack. Sprinkle muffin tops with confectioners' sugar, if desired. Serve warm."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4467940.jpg", "prep_time_minutes": 25, "rating_stars": 4.27, "review_count": 152, "time_scraped": 1498206485, "title": "Fudgy Chocolate Chip Muffins", "total_time_minutes": 35, "url": "http://allrecipes.com/Recipe/7019/"}
{"author": "Clem Zulinski", "cook_time_minutes": 30, "description": "This may not be New York Pumpernickel, but it is the one we use at home.", "error": false, "footnotes": [], "ingredients": ["2 cups warm milk", "2 tablespoons vegetable oil", "4 tablespoons molasses", "3 1/4 cups bread flour", "1 1/3 cups rye flour", "1/2 cup cornmeal", "1 1/3 teaspoons salt", "2 2/3 teaspoons active dry yeast", "4 tablespoons unsweetened cocoa powder", "2 2/3 tablespoons brown sugar"], "instructions": ["Mix well bread flour, rye flour, cornmeal, salt, yeast, cocoa, and brown sugar. Add milk, oil, and molasses. Mix thoroughly. When mixed well enough that the dough holds together, knead by hand 15-20 minutes.", "Cover, let rise in bowl 30 minutes. Punch down, form, and place into 9 1/2x5 inch pan. Cover with damp cloth and let rise about 1 hour.", "Bake in preheated 375 degree F (190 degrees C) oven 25 to 30 minutes, covering top with aluminum foil last 10 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/798353.jpg", "prep_time_minutes": 60, "rating_stars": 4.14, "review_count": 21, "time_scraped": 1498207459, "title": "Pumpernickel Bread II", "total_time_minutes": 150, "url": "http://allrecipes.com/Recipe/7020/"}
{"author": "Michelle Chen", "cook_time_minutes": 25, "description": "This is an authentic Indian Naan recipe. I have made this many times. It goes well with Indian curry which has a lot of gravy, such as the Butter Chicken.", "error": false, "footnotes": ["Partner tip: Reynolds® Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["2/3 cup warm water (110 degrees F/45 degrees C)", "1 teaspoon active dry yeast", "1 teaspoon white sugar", "2 cups all-purpose flour", "1 teaspoon salt", "1/4 cup ghee", "2 tablespoons plain yogurt", "2 teaspoons kalonji (onion seed)"], "instructions": ["Whisk the warm water with the yeast and sugar until the yeast is dissolved. Cover and let stand in a warm place for 10 minutes.", "Sift flour and salt three times into a large bowl add the yeast mixture, half of the ghee and all the yogurt. Mix into a soft dough then knead on a floured surface for about 5 minutes or until dough is smooth and elastic. Place the dough in a large greased bowl, cover and let stand in a warm place for 1 1/2 hours or until the dough is doubled in size .", "Punch down dough then knead for 5 minutes. Divide dough into 6 pieces. Roll each piece out into 8 inch round naans.", "Cover an oven tray with foil and grease the foil. Brush the naan with a little of the remaining ghee and sprinkle with some of the kalonji. Cook naan one at a time under the broiler for about 2 minutes on each side or until puffed and just browned."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/96729.jpg", "prep_time_minutes": 20, "rating_stars": 4.5, "review_count": 104, "time_scraped": 1498207992, "title": "Indian Naan II", "total_time_minutes": 145, "url": "http://allrecipes.com/Recipe/7021/"}
{"author": "Brent", "cook_time_minutes": 15, "description": "My grandmother used to serve this with cheese as a pre-dinner snack while we waited for the turkey. She used a heavy cast iron griddle, lightly floured. I use a 1 1/2 inch wood dowel to roll out nice and thin.", "error": false, "footnotes": [], "ingredients": ["1 cup buttermilk", "6 tablespoons light corn syrup", "1/4 cup white sugar", "1/2 teaspoon baking soda", "1/8 teaspoon ground cardamom", "3 1/2 cups all-purpose flour"], "instructions": ["In a large bowl, mix by hand sour milk or buttermilk, corn syrup, sugar, soda, cardamom, and flour until mixture becomes a soft pliable dough.", "Divide the dough into 12 or so pieces. Roll out each piece until about 1/8 inch thick.", "Bake on a lightly floured griddle over very low heat for 12 to 15 minutes per side. Serve warm with your favorite cheese or jam."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/996053.jpg", "prep_time_minutes": 45, "rating_stars": 4.08, "review_count": 12, "time_scraped": 1498207669, "title": "Lefse II", "total_time_minutes": 60, "url": "http://allrecipes.com/Recipe/7022/"}
{"author": "Laura", "cook_time_minutes": 25, "description": "Very, very chocolate-y! Great with a glass of milk.", "error": false, "footnotes": [], "ingredients": ["6 (1 ounce) squares semisweet chocolate", "1/3 cup unsalted butter", "3/4 cup buttermilk", "1/2 cup white sugar", "1 egg", "1 1/2 teaspoons vanilla extract", "1 2/3 cups all-purpose flour", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 cup mini semi-sweet chocolate chips"], "instructions": ["Preheat the oven to 400 degrees F (205 degrees C). Line 12 muffin cups with papers.", "In a small saucepan over low heat, melt the semisweet chocolate together with the butter. Let stand until cooled, about 10 minutes.", "Lightly beat the egg. In a small bowl, stir together the chocolate-butter mixture with the buttermilk, sugar, egg, and vanilla, until blended well.", "In a large bowl, stir together flour, soda, and salt. Make a hole in the center of the dry ingredients, pour in the chocolate mixture, and stir until just combined. Stir in the mini chocolate chips. Spoon the batter into the lined muffin cups.", "Bake at 400 degrees F (205 degrees C) for 20-25 minutes or until a toothpick inserted in the center of a muffin comes out clean. Remove muffin tin from oven and let stand at least 5 minutes, before removing the muffins and letting them cool on a wire rack. Serve warm or cooled; can be frozen as well."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/633193.jpg", "prep_time_minutes": 25, "rating_stars": 4.12, "review_count": 135, "time_scraped": 1498205458, "title": "Chocolate Chocolate Chip Muffins", "total_time_minutes": 65, "url": "http://allrecipes.com/Recipe/7023/"}
{"author": "Linda Jean", "cook_time_minutes": 10, "description": "This makes a great gift for friends and neighbors. Also great for Christmas Bazaar item. Decorate with pretty label and a circle of Christmas fabric under the jar ring. Using the same basic recipe you can substitute different fruits and vegetables to make other varieties.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["2/3 cup shortening", "2 2/3 cups white sugar", "4 eggs", "2 cups mashed bananas", "2/3 cup water", "3 1/3 cups all-purpose flour", "1/2 teaspoon baking powder", "2 teaspoons baking soda", "1 1/2 teaspoons salt", "1 teaspoon ground cinnamon", "1 teaspoon ground cloves", "2/3 cup chopped pecans"], "instructions": ["Preheat oven to 325 degrees F (165 degrees C). Grease insides of 8 (1 pint) straight sided, wide mouth canning jars.", "In a large bowl, cream shortening and sugar until light and fluffy. Beat in eggs, bananas, and water. Sift together flour, baking powder, soda, salt, cinnamon, and cloves. Add to banana mixture. Stir in nuts.", "Pour mixture into greased WIDE MOUTH pint jars, filling 1/2 full of batter. Do NOT put lids on jars for baking. Be careful to keep the rims clean, wiping off any batter that gets on the rims.", "Bake at 325 degrees F (165 degrees C) for 45 minutes. Meanwhile, sterilize the lids and rings in boiling water.", "As soon as cake is done, remove from oven one at a time, wipe rims of jars and put on lid and ring. Jars will seal as cakes cool. Place the jars on the counter and listen for them to \"ping\" as they seal. If you miss the \"ping\", wait until they are completely cool and press on the top of the lid. If it doesn't move at all, it's sealed.", "Jars should be eaten immediately or kept sealed in refrigerator for up to a week."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/5110.jpg", "prep_time_minutes": 45, "rating_stars": 4.77, "review_count": 215, "time_scraped": 1498208383, "title": "Banana Nut Bread Baked in a Jar", "total_time_minutes": 65, "url": "http://allrecipes.com/Recipe/7024/"}
{"author": "LITSTER5", "cook_time_minutes": 5, "description": "Bread machine recipe.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 1/4 cups water", "2 tablespoons margarine", "1 teaspoon salt", "3 cups all-purpose flour", "1/2 cup rolled oats", "2 tablespoons brown sugar", "1 1/2 teaspoons active dry yeast"], "instructions": ["Add ingredients to bread machine pan in order recommended by your manufacturer. Use regular light setting."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/257322.jpg", "prep_time_minutes": 180, "rating_stars": 4.73, "review_count": 658, "time_scraped": 1498206567, "title": "Light Oat Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7025/"}
{"author": "Frank De Lisi", "cook_time_minutes": 5, "description": "A tasty and healthy toasting bread for cold winter mornings.", "error": false, "footnotes": [], "ingredients": ["1 cup bread flour", "1 1/4 cups whole wheat flour", "1/4 cup rolled oats", "1/8 cup wheat germ", "2 tablespoons honey", "7/8 cup milk", "1/2 cup water", "1 teaspoon salt", "1 tablespoon butter", "1/4 (.25 ounce) package active dry yeast"], "instructions": ["Place ingredients in the bread machine pan in the order suggested by the manufacturer. Select the multigrain setting, and press start."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/506180.jpg", "prep_time_minutes": 180, "rating_stars": 4.16, "review_count": 37, "time_scraped": 1498206246, "title": "Honey Oatmeal Bread I", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7026/"}
{"author": "Judy Taubert", "cook_time_minutes": 30, "description": "A moist, heavy loaf.  Perfect accompaniment to a rich, thick stew.", "error": false, "footnotes": ["Partner tip: Reynolds® Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 potato, peeled and diced", "1 1/2 cups water", "2 (.25 ounce) packages active dry yeast", "6 1/2 cups all-purpose flour", "3 tablespoons white sugar", "2 tablespoons shortening", "1 tablespoon salt", "2 tablespoons all-purpose flour"], "instructions": ["In a medium saucepan cook potato cubes in water for about 12 minutes, or until tender. Do not drain. Cool mixture to 110 degrees F (43 degrees C). Set aside 1/2 cup of the cooking liquid. Mash potato and remaining liquid; if necessary add warm water to make 2 cups potato mixture.", "In a large mixing bowl, sprinkle yeast on reserved 1/2 cup potato water. Add mashed potato mixture, 2 cups of the flour, sugar, shortening, and salt. Beat with an electric mixer on low speed for 1/2 minute, scraping sides of bowl constantly. Beat 3 minutes at high speed. Stir in as much of the remaining flour as you can mix in by hand.", "Turn dough out onto a lightly floured surface. Knead in enough of the remaining flour to make a moderately stiff dough. Knead for 6 to 8 minutes, or until dough is smooth and elastic. Place in a lightly greased bowl; turn once to grease surface. Cover. Let rise in warm place until doubled in bulk, about 1 hour.", "Punch down, and turn out onto a lightly floured surface. Divide dough in half. Cover, and let rest for 10 minutes. Shape each half into a loaf. Place in greased 8 x 4 x 2 inch loaf pans. Cover. Let rise until nearly double, about 35 minutes. Before baking, brush tops with a little water and dust with additional flour.", "Bake at 375 degree F (190 degrees C) for 40 to 45 minutes. Cover with foil for the last 15 minutes of baking to prevent over-browning. Remove from pan; cool on wire rack."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1563656.jpg", "prep_time_minutes": 40, "rating_stars": 4.62, "review_count": 68, "time_scraped": 1498206531, "title": "Potato Bread III", "total_time_minutes": 170, "url": "http://allrecipes.com/Recipe/7027/"}
{"author": "Judy Taubert", "cook_time_minutes": 15, "description": "Great eaten fresh from oven. Used to make sub sandwiches, etc.", "error": false, "footnotes": ["Editor's Note:", "For tips, see our article on Forming and Baking Baguettes.", "Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 cup water", "2 1/2 cups bread flour", "1 tablespoon white sugar", "1 teaspoon salt", "1 1/2 teaspoons bread machine yeast", "1 egg yolk", "1 tablespoon water"], "instructions": ["Place 1 cup water, bread flour, sugar, salt and yeast into bread machine pan in the order recommended by manufacturer. Select Dough cycle, and press Start.", "When the cycle has completed, place dough in a greased bowl, turning to coat all sides. Cover, and let rise in a warm place for about 30 minutes, or until doubled in bulk. Dough is ready if indentation remains when touched.", "Punch down dough. On a lightly floured surface, roll into a 16x12 inch rectangle. Cut dough in half, creating two 8x12 inch rectangles. Roll up each half of dough tightly, beginning at 12 inch side, pounding out any air bubbles as you go. Roll gently back and forth to taper end. Place 3 inches apart on a greased cookie sheet. Make deep diagonal slashes across loaves every 2 inches, or make one lengthwise slash on each loaf. Cover, and let rise in a warm place for 30 to 40 minutes, or until doubled in bulk.", "Preheat oven to 375 degrees F (190 degrees C). Mix egg yolk with 1 tablespoon water; brush over tops of loaves.", "Bake for 20 to 25 minutes in the preheated oven, or until golden brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/767926.jpg", "prep_time_minutes": 25, "rating_stars": 4.77, "review_count": 1174, "time_scraped": 1498205693, "title": "French Baguettes", "total_time_minutes": 110, "url": "http://allrecipes.com/Recipe/7028/"}
{"author": "Karin Christian", "cook_time_minutes": 10, "description": "This is a very easy recipe that has the added bonus of being lowfat!  It bakes into a round loaf.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["3 1/2 cups all-purpose flour", "1/2 cup quick cooking oats", "1 teaspoon salt", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 (8 ounce) container low-fat sour cream", "3/4 cup skim milk", "2 tablespoons honey", "1 tablespoon white sugar", "1/4 cup butter, melted", "2 tablespoons butter, melted"], "instructions": ["Preheat oven to 375 degrees F (190 degrees C).", "In a large bowl, mix together flour, 1/2 cup oats, salt, baking powder, and baking soda.", "In another bowl, mix together sour cream, milk, honey, and sugar. Add to the flour mixture, and mix just until well blended. Stir in melted butter or margarine.", "Turn dough onto a lightly sprayed baking sheet. Shape into a round, lightly mounded circle, about 8 inches diameter. Brush the top of the loaf with melted butter or margarine, and sprinkle with remaining 1 tablespoon oats. With a knife, score the top of the loaf into quarters.", "Bake for about 40 minutes, or until browned. Cool completely before slicing."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4465760.jpg", "prep_time_minutes": 40, "rating_stars": 4.7, "review_count": 44, "time_scraped": 1498206498, "title": "Oatmeal Soda Bread", "total_time_minutes": 50, "url": "http://allrecipes.com/Recipe/7030/"}
{"author": "Carol chi-wa Chung", "cook_time_minutes": 50, "description": "This Chinese Steamed Bun recipe has a meat and vegetable filling.  The filling is best if allowed to rest in the refrigerator overnight.  Use meat that is half fat and half flesh for the most tender filling.  A wok equipped with a stainless steel steam plate, a plate with holes to allow steam to pass, is required to make these tasty buns.", "error": false, "footnotes": ["Get the recipe for Chinese Steamed Buns."], "ingredients": ["8 ounces chopped pork", "1 (4 ounce) can shrimp, drained and chopped", "1 teaspoon salt", "2 green onions", "1 tablespoon chopped fresh ginger root", "1 tablespoon light soy sauce", "1 tablespoon rice wine", "1 tablespoon vegetable oil", "1 tablespoon white sugar", "ground black pepper to taste", "2 1/2 tablespoons water", "1 recipe Chinese Steamed Buns"], "instructions": ["Cook chopped pork in a wok over medium heat. After 3 minutes of cooking add chopped shrimp if desired. Cook until pork is no longer pink. Drain, season with salt and set aside to cool.", "Mix together green onions, ginger, soy sauce, rice wine, oil, sugar, and pepper. Stir in minced meat. Stir in water and mix thoroughly. Chill in freezer for 2 hours, or in refrigerator overnight to firm up and blend flavors.", "Prepare dough for Chinese Steamed Buns.", "Shape dough into balls. Roll each out into a circle, (like Won-Ton wrappers). Put 1 tablespoonful of prepared meat mixture in the center of each circle, and wrap dough around filling. Place seams down onto wax paper squares. Let stand until doubled, about 30 minutes.", "Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling. Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate leaving 1 to 2 inches between the buns. At least 2 inches space should be left between steam-plate and the wok. Cover wok with lid. Steam buns over boiling water for 15 to 20 minutes.", "REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/239510.jpg", "prep_time_minutes": 30, "rating_stars": 4.57, "review_count": 20, "time_scraped": 1498207478, "title": "Chinese Steamed Buns with Meat Filling", "total_time_minutes": 240, "url": "http://allrecipes.com/Recipe/7031/"}
{"author": "Carol chi-wa Chung", "cook_time_minutes": 50, "description": "This is a simple recipe for Char-Siu Bau. A wok equipped with a stainless steel steam plate--a plate with holes to allow steam to pass--is required to make these tasty buns.", "error": false, "footnotes": ["Get the dough recipe for Chinese Steamed Buns.", "Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1/2 pound boneless pork loin roast", "1/2 cup barbecue sauce", "3 tablespoons shallots, chopped", "1/3 cup chicken broth", "1 tablespoon dark soy sauce", "1 tablespoon vegetable oil", "1 tablespoon white sugar", "1 recipe Chinese Steamed Buns"], "instructions": ["Mix together pork, barbecue sauce, shallots, flour, chicken stock, soy sauce, oil, and sugar. Chill in refrigerator for at least 6 hours.", "Preheat grill for medium heat and lightly oil the grate. Cook the pork until an instant-read meat thermometer reaches 145 degrees F (63 degrees C). Allow to cool; shred or finely chop the meat.", "Prepare dough for Chinese Steamed Buns (see footnote).", "Shape dough into balls. Roll each out into a circle, (like won-ton wrappers). Put 1 tablespoonful of prepared meat mixture in the center of each circle, and wrap dough around filling. Place seam-side down onto wax paper squares. Let stand until doubled, about 30 minutes.", "Bring water to a boil in wok, and reduce heat to medium; the water should still be boiling. Place steam-plate on a small wire rack in the middle of the wok. Transfer as many buns on wax paper as will comfortably fit onto steam-plate, leaving 1 to 2 inches between the buns. At least 2 inches space should be left between steam-plate and the wok. Cover wok with lid. Steam buns over boiling water for 15 to 20 minutes.", "REMOVE LID BEFORE you turn off heat, or else water will drip back onto bun surface and produce yellowish \"blisters\" on bun surfaces. Continue steaming batches of buns until all are cooked."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/31733.jpg", "prep_time_minutes": 50, "rating_stars": 4.48, "review_count": 22, "time_scraped": 1498215479, "title": "Chinese Steamed Buns with BBQ Pork Filling", "total_time_minutes": 580, "url": "http://allrecipes.com/Recipe/7032/"}
{"author": "P.Weiss", "cook_time_minutes": 15, "description": "This moist, dense and nutty Carrot Bread has been a family tradition for years.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["3 teaspoons baking soda", "1/2 teaspoon salt", "2 teaspoons ground cinnamon", "1 teaspoon ground nutmeg", "3 cups all-purpose flour", "3 carrots", "1 (15 ounce) can crushed pineapple", "1 1/2 cups vegetable oil", "2 cups white sugar", "6 eggs", "1 cup chopped walnuts", "1 1/2 cups raisins"], "instructions": ["Preheat oven to 375 degrees F (190 degrees C). Grease and flour two 9x5 inch loaf pans.", "Sift together baking soda, salt, spices, and flour.", "In a large bowl, combine ground carrots, pineapple, oil, and sugar. Mix in eggs. Blend flour mixture into carrot mixture. Mix well. Fold nuts and raisins into batter. Pour into prepared pans.", "Bake at 375 degrees F (190 degrees C)for 45 minutes, or until a toothpick inserted into bread comes out clean."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/2014006.jpg", "prep_time_minutes": 45, "rating_stars": 4.51, "review_count": 33, "time_scraped": 1498206092, "title": "Mary Anne's Moist and Nutty Carrot Loaf", "total_time_minutes": 60, "url": "http://allrecipes.com/Recipe/7033/"}
{"author": "Helen H.", "cook_time_minutes": 10, "description": "Add any fruits, vegetables, nuts and spices that you desire.", "error": false, "footnotes": ["Note", "One cup of any type shredded fruit or vegetable may be used in this recipe. Depending on what you use, you may need to add some water to the mixture. We suggest adding only 1 tablespoon at a time, just until ingredients are evenly moist."], "ingredients": ["3 cups all-purpose flour", "2 teaspoons baking powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 cup white sugar", "1/2 cup vegetable oil", "2 eggs", "1 cup shredded apple", "3/4 cup chopped walnuts", "1/2 teaspoon vanilla extract"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease one 4 1/2 x 8 1/2 inch loaf pan.", "Mix flour, baking powder, soda, salt, sugar, oil, eggs, apple, walnuts, and vanilla only until dry ingredients are moistened.", "Bake in greased 4 1/2 x 8 1/2 inch loaf pan at 350 degrees F (175 degrees C) for 35 to 40 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/535516.jpg", "prep_time_minutes": 40, "rating_stars": 3.62, "review_count": 12, "time_scraped": 1498206313, "title": "Basic Fruit Bread Recipe", "total_time_minutes": 50, "url": "http://allrecipes.com/Recipe/7035/"}
{"author": "Mary", "cook_time_minutes": 15, "description": "I have been looking for a good Russian Black Bread recipe. This one is the closest I have come. The vinegar adds a bit of a bite, but believe me, with cheese it is marvelous.", "error": false, "footnotes": ["Editor's Note:", "To make this recipe in a stand mixer, combine all of the ingredients except the softened butter in the mixing bowl. Mix on low speed using the dough hook, scraping the dough down occasionally, for 10 minutes. Add the softened butter and mix for an additional 5 minutes. Transfer the dough to a greased bowl, cover it with plastic wrap and a kitchen towel, and allow it to rise until doubled, about 1 hour.", "Grease two 9x5-inch loaf pans. Deflate the dough and turn it out onto a lightly floured surface. Divide the dough in half. Flatten the dough pieces into rectangles, pressing down with your hands to pop any air bubbles. Fold the dough into thirds, rolling it slightly under your palms to form a loaf, and pinch the seam to seal. Place the loaves into the loaf pans, seam-side down, cover with a floured kitchen towel, and allow it to rise again until doubled, about 30 minutes. Bake the loaves in a preheated 400 degree oven (200 degrees C) until the crust is dark and the bottom of the loaf sounds hollow when tapped, 25 to 30 minutes. Remove the bread from the pan and cool on a wire rack."], "ingredients": ["1 1/2 cups water", "2 tablespoons cider vinegar", "2 1/2 cups bread flour", "1 cup rye flour", "1 teaspoon salt", "2 tablespoons margarine", "2 tablespoons dark corn syrup", "1 tablespoon brown sugar", "3 tablespoons unsweetened cocoa powder", "1 teaspoon instant coffee granules", "1 tablespoon caraway seed", "1/4 teaspoon fennel seed (optional)", "2 teaspoons active dry yeast"], "instructions": ["Place ingredients into the bread machine in order suggested by the manufacturer.", "Use the whole wheat, regular crust setting.", "After the baking cycle ends, remove bread from pan, place on a cake rack, and allow to cool for 1 hour before slicing."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/36112.jpg", "prep_time_minutes": 180, "rating_stars": 4.67, "review_count": 167, "time_scraped": 1498208120, "title": "Russian Black Bread", "total_time_minutes": 195, "url": "http://allrecipes.com/Recipe/7034/"}
{"author": "Mary", "cook_time_minutes": 30, "description": "This recipe uses a white bread straight dough as the base. When making raisin bread, you may use brown sugar instead of white. Grated orange or lemon rind may be added.", "error": false, "footnotes": [], "ingredients": ["2 cups milk", "1 (.25 ounce) package active dry yeast", "1/4 cup warm water (110 degrees F/45 degrees C)", "2 tablespoons white sugar", "1 1/2 tablespoons shortening", "2 1/2 teaspoons salt", "6 cups all-purpose flour", "2 cups raisins"], "instructions": ["Scald milk.", "Soften yeast in warm water; let stand 5 minutes.", "Pour scalded milk over sugar, shortening, and salt in a bowl. When lukewarm, blend in raisins and 1 cup flour.", "Stir in yeast and beat well. Add 3 cups flour, continue beating until smooth. Beat in enough remaining flour to make a soft dough. Turn on lightly floured surface; let rest about 5 minutes.", "Knead until smooth and elastic. Place dough in a greased bowl; turn to bring greased surface to top. Cover, let stand in warm place until dough is doubled, about 1 hour.", "Punch down, cover, and let rise again until almost doubled in bulk.", "Turn on lightly floured surface. Divide dough in half; let rest 5 to 10 minutes.", "Shape into loaves. Place in 2 greased loaf pans 9 1/2 x 5 1/4 x 2 3/4 inches. Cover and let rise until doubled, about 1 hour.", "Bake in a 400 degree F (205 degrees C) oven for about 50 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/322871.jpg", "prep_time_minutes": 50, "rating_stars": 4.2, "review_count": 3, "time_scraped": 1498205219, "title": "Raisin Bread III", "total_time_minutes": 250, "url": "http://allrecipes.com/Recipe/7036/"}
{"author": "Tony", "cook_time_minutes": 5, "description": "I've used dill in breads and just love the flavor, but one day while preparing hamburgers, I wondered if I could use actual pickles. Here is my creation use dill pickle juice for half of the water for the deluxe version. Enjoy!", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["1 cup warm water (110 degrees F/45 degrees C)", "1 dill pickle, chopped", "1 tablespoon butter, softened", "1 tablespoon dried minced onion", "1 teaspoon dried parsley", "1/2 teaspoon dried dill weed", "1/4 teaspoon salt", "3 1/8 cups bread flour", "2 teaspoons active dry yeast"], "instructions": ["Place ingredients in the pan of the bread machine in the order suggested by the manufacturer.", "Use the white bread, medium crust setting."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/3869049.jpg", "prep_time_minutes": 180, "rating_stars": 4.11, "review_count": 47, "time_scraped": 1498205753, "title": "Dill Pickle Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7039/"}
{"author": "Laura", "cook_time_minutes": 10, "description": "Delicious, easy-to-make biscuits.", "error": false, "footnotes": [], "ingredients": ["5 cups all-purpose flour", "1/4 cup white sugar", "3 teaspoons baking powder", "1 teaspoon baking soda", "1 1/2 teaspoons salt", "1 cup shortening", "1 (.25 ounce) package active dry yeast", "1/4 cup warm water (110 degrees F/45 degrees C)", "2 cups buttermilk", "2 tablespoons butter, melted"], "instructions": ["Dissolve yeast in warm water.", "Sift together flour, sugar, soda, baking powder, and salt. Add buttermilk and dissolved yeast. Add shortening and stir. Store dough, covered, in the fridge until ready to use.", "Roll out on a lightly floured surface or shape into balls--these do not need to rise. Brush tops of biscuits with melted butter.", "Bake at 400 degrees F (205 degrees C) for 15-20 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/184711.jpg", "prep_time_minutes": 20, "rating_stars": 4.14, "review_count": 62, "time_scraped": 1498206570, "title": "Angel Biscuit Rolls", "total_time_minutes": 30, "url": "http://allrecipes.com/Recipe/7037/"}
{"author": "Sandra Chan", "cook_time_minutes": 5, "description": "This is an Italian Christmas bread. This recipe is only suitable for the bread machine. I have tried it many times successfully, you will love it.", "error": false, "footnotes": [], "ingredients": ["3/4 cup warm water", "1/4 cup butter", "2 eggs", "1 1/2 teaspoons vanilla extract", "3 1/4 cups bread flour", "2 tablespoons white sugar", "2 tablespoons dry milk powder", "1 1/2 teaspoons salt", "2 teaspoons bread machine yeast", "1/2 cup chopped dried mixed fruit"], "instructions": ["Place all of the ingredients except for the mixed fruit into the pan of your bread machine in order directed by manufacturer. Select Sweet or Basic/White bread cycle, and use the Medium or Light crust color. Do not use the delay cycles. Add the fruit 5 to 10 minutes before the last kneading cycle ends, or when the raisin or nut signal starts."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/278215.jpg", "prep_time_minutes": 180, "rating_stars": 4.4, "review_count": 44, "time_scraped": 1498207042, "title": "Panettone II", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7038/"}
{"author": "John Pickett", "cook_time_minutes": 30, "description": "This recipe will produce the biggest biscuits in the history of the world! Serve these gems with butter, preserves, honey, gravy or they can also be used as dinner rolls...you get the picture. The dough can also be prepared several hours, and up to a day ahead of time. If so, turn dough out onto aluminum foil that has been either floured, lightly buttered or lightly sprayed with cooking spray. Roll up foil until it is sealed, and refrigerate.  Don't be surprised if your biscuits rise even higher because the baking powder has had more time to act in the dough. You may have to make a few batches before you get desired results: desired results equals huge mongo biscuits.", "error": false, "footnotes": ["Parchment can be used for easier cleanup/removal from the pan."], "ingredients": ["2 cups all-purpose flour", "1 tablespoon baking powder", "1 teaspoon salt", "1 tablespoon white sugar", "1/3 cup shortening", "1 cup milk"], "instructions": ["Preheat oven to 425 degrees F (220 degrees C).", "In a large bowl, whisk together the flour, baking powder, salt, and sugar. Cut in the shortening until the mixture resembles coarse meal. Gradually stir in milk until dough pulls away from the side of the bowl.", "Turn out onto a floured surface, and knead 15 to 20 times. Pat or roll dough out to 1 inch thick. Cut biscuits with a large cutter or juice glass dipped in flour. Repeat until all dough is used. Brush off the excess flour, and place biscuits onto an ungreased baking sheet.", "Bake for 13 to 15 minutes in the preheated oven, or until edges begin to brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4512167.jpg", "prep_time_minutes": 15, "rating_stars": 4.63, "review_count": 3160, "time_scraped": 1498207752, "title": "J.P.'s Big Daddy Biscuits", "total_time_minutes": 45, "url": "http://allrecipes.com/Recipe/7040/"}
{"author": "John T. Jurkiewicz", "cook_time_minutes": 10, "description": "A delicious dinner roll that is made from beer, honey, and a slight pinch of cinnamon.  Excellent with turkey, roasts etc.  Different beer may be substituted, but be advised that a highly hopped beer will create an astringent bitter taste. The unique taste comes from the malt used in making the beer.", "error": false, "footnotes": [], "ingredients": ["4 cups bread flour", "2 tablespoons honey", "1/4 teaspoon salt", "1 tablespoon margarine", "10 ounces dark beer", "1 (.25 ounce) package active dry yeast", "1 pinch ground cinnamon", "2 tablespoons butter, melted"], "instructions": ["Allow 10 to 12 ounces of beer to reach room temperature and go flat. This will take approximately 3 to 4 hours.", "Combine flattened beer, butter, cinnamon, salt, and honey in the pan of bread machine. Add flour and yeast being careful that the yeast does not touch the liquid. Select Dough setting, and Start.", "After the dough has risen, remove the dough from the pan. Form into a long loaf; cut and form rolls. Place on a floured baking sheet, cover, and allow to rise for approximately 45 minutes.", "Brush top of rolls with melted butter.", "Bake at 350 degrees F (175 degrees C) for 30 minutes, or until golden brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/87261.jpg", "prep_time_minutes": 30, "rating_stars": 4.4, "review_count": 37, "time_scraped": 1498205536, "title": "Beer Rolls", "total_time_minutes": 350, "url": "http://allrecipes.com/Recipe/7041/"}
{"author": "Tiffany Leyda", "cook_time_minutes": 30, "description": "This traditional Polish egg bread is  wonderfully light with a slightly sweet flavor.", "error": false, "footnotes": ["Cook's Note:", "This recipe can be shaped into 3 large loaves or 6 small ones. (Check small loaves at about 30 minutes during baking.) You may use orange peel in place of the lemon zest, if you prefer."], "ingredients": ["For the Sponge:", "2 (.25 ounce) packages active dry yeast", "1/2 cup warm water (110 degrees F/45 degrees C)", "1/2 cup white sugar", "3 cups warm milk", "4 cups all-purpose flour", "For the Dough:", "6 eggs, beaten", "1/2 cup white sugar", "1 cup butter, softened", "1/4 teaspoon salt", "1/4 teaspoon lemon zest", "12 cups all-purpose flour", "1 egg", "1 tablespoon water", "2 tablespoons butter, melted"], "instructions": ["Proof the yeast in 1/2 cup warm water in a large bowl until slightly frothy.", "In the meantime, dissolve 1/2 cup sugar in the warm milk; allow to cool to lukewarm. Once cooled, add the milk mixture to the yeast mixture along with 4 cups of flour. Mix well with a wooden spoon. Cover and put in a dark, warm place until the mixture is bubbly and doubled in size, about 2 hours.", "Stir in the beaten eggs, 1/2 cup sugar, 1 cup butter, salt, and lemon peel. Stir well to blend. Begin adding the remaining flour a cup at a time to form a very soft dough.", "Knead the dough on a floured board until soft and elastic, about 10 minutes. Place the dough in a greased bowl, turning to coat all sides. Cover bowl with plastic wrap and allow to rise in a warm place until doubled, about 2 hours. Punch dough down, and allow to rise again for 30 minutes.", "Divide dough into three parts (see Cook's Note). Shape into slightly rounded loaves, and place on greased baking sheets. Let rise until doubled, about 45 minutes to 1 hour. Beat 1 egg with 1 tablespoon water; brush onto loaves.", "Preheat oven to 350 degrees F (175 degrees C).", "Bake in preheated oven until loaves are deep brown, 45 to 50 minutes. Once they are done, brush the tops with melted butter for a soft crust."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/994982.jpg", "prep_time_minutes": 50, "rating_stars": 4.62, "review_count": 42, "time_scraped": 1498208466, "title": "Paska Bread", "total_time_minutes": 400, "url": "http://allrecipes.com/Recipe/7042/"}
{"author": "Suzy", "cook_time_minutes": 5, "description": "Easy recipe for challah or egg bread using a bread machine. I use the light setting on my bread machine.", "error": false, "footnotes": ["Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["3/4 cup milk", "2 eggs", "3 tablespoons margarine", "3 cups bread flour", "1/4 cup white sugar", "1 1/2 teaspoons salt", "1 1/2 teaspoons active dry yeast"], "instructions": ["Add ingredients to the pan of the bread machine in the order suggested by the manufacturer.", "Select Basic Bread and Light Crust settings. Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/43320.jpg", "prep_time_minutes": 180, "rating_stars": 4.68, "review_count": 325, "time_scraped": 1498206656, "title": "Bread Machine Challah I", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7043/"}
{"author": "Diana", "cook_time_minutes": 10, "description": "Pumpkin Bread, a tried and true recipe.  I usually make it without the raisins and walnuts, and I get tons of compliments!", "error": false, "footnotes": [], "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "1/2 teaspoon salt", "1/2 teaspoon pumpkin pie spice", "1/4 teaspoon baking soda", "1/4 teaspoon ground cloves", "1 cup packed brown sugar", "1/3 cup butter flavored shortening", "2 eggs", "1 cup pumpkin puree", "1/4 cup milk", "1/2 cup raisins (optional)", "1/4 cup chopped walnuts (optional)"], "instructions": ["In a mixing bowl combine flour, baking powder, salt, pumpkin pie spice, baking soda, and cloves.", "In a separate bowl, cream together shortening and brown sugar. Mix in eggs, pumpkin, and milk. Stir flour mixture into wet mixture until just combined. Fold in raisins and walnuts if desired. Pour into a greased and floured 9 x 5 inch loaf pan.", "Bake at 350 degrees F (175 degrees ) for 50 to 55 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1518653.jpg", "prep_time_minutes": 50, "rating_stars": 4.46, "review_count": 31, "time_scraped": 1498206331, "title": "Pumpkin Bread V", "total_time_minutes": 60, "url": "http://allrecipes.com/Recipe/7044/"}
{"author": "re", "cook_time_minutes": 20, "description": "Best Ever!", "error": false, "footnotes": [], "ingredients": ["2 (.25 ounce) packages active dry yeast", "2 1/2 cups warm water (110 degrees F)", "1 (18.25 ounce) package yellow cake mix", "6 cups all-purpose flour, divided", "3 eggs", "1/3 cup vegetable oil", "1 1/2 teaspoons salt", "1/2 cup butter, softened", "4 tablespoons white sugar", "2 tablespoons ground cinnamon", "1/4 cup butter, melted", "3 cups confectioners' sugar", "1 1/2 teaspoons vanilla extract", "2/3 cup milk"], "instructions": ["In a large bowl, dissolve yeast in warm water, and let stand for 3 minutes. Add cake mix, 1 cup flour, eggs, oil, and salt; beat well. Stir in remaining flour until a soft dough forms.", "Knead on well floured surface for about 5 minutes. Place in a greased bowl, and turn to coat the dough surface. Let rise until doubled in bulk, about 45 minutes.", "Preheat oven to 350 degrees F (175 degrees C).", "Punch down, and divide into two equal parts. Roll out each section on a lightly floured surface. Spread each with softened butter and sprinkle with sugar and cinnamon.", "Roll up like jelly rolls and cut buns 1 1/2 inches thick with a piece of dental floss or a dull knife. Place in greased baking pans, and allow to rise until doubled.", "Bake at 350 degrees F (175 degrees C) for 25 to 35 minutes or until golden brown.", "Meanwhile, combine confectioners sugar, 1/4 cup melted butter, vanilla, and milk. Remove baked buns from oven and drizzle with frosting."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1130924.jpg", "prep_time_minutes": 30, "rating_stars": 4.49, "review_count": 247, "time_scraped": 1498206615, "title": "Best Ever Cinnamon Buns", "total_time_minutes": 135, "url": "http://allrecipes.com/Recipe/7045/"}
{"author": "Liz B.", "cook_time_minutes": 5, "description": "Oatmeal Molasses Bread via the bread machine.   I often just use the dough cycle, take the dough out when done, and let it rise on more time. I then bake it in the oven at 350 degrees F (175 degrees C) for about 28 minutes.  The texture is just like a real homemade loaf. Enjoy!!!!!", "error": false, "footnotes": [], "ingredients": ["1 (.25 ounce) package active dry yeast", "1 cup quick cooking oats", "3 cups bread flour", "1 teaspoon salt", "1/2 cup molasses", "1 tablespoon vegetable oil", "1 1/3 cups water", "1/4 cup honey"], "instructions": ["Place ingredients in the pan of the bread machine in the order suggested by the manufacturer.", "Select White Bread setting, and Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/2887067.jpg", "prep_time_minutes": 180, "rating_stars": 4.16, "review_count": 57, "time_scraped": 1498205777, "title": "Oatmeal Molasses Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7046/"}
{"author": "Karin Christian", "cook_time_minutes": 20, "description": "This is the bread that Ezekiel lived off of while he was in the desert for two years. It is supposed to be nutritionally complete. The recipe calls for grinding your own flour from a variety of grains and dried beans.", "error": false, "footnotes": [], "ingredients": ["2 1/2 cups wheat berries", "1 1/2 cups spelt flour", "1/2 cup barley", "1/2 cup millet", "1/4 cup dry green lentils", "2 tablespoons dry great Northern beans", "2 tablespoons dry kidney beans", "2 tablespoons dried pinto beans", "4 cups warm water (110 degrees F/45 degrees C)", "1 cup honey", "1/2 cup olive oil", "2 (.25 ounce) packages active dry yeast", "2 tablespoons salt"], "instructions": ["Measure the water, honey, olive oil, and yeast into a large bowl. Let sit for 3 to 5 minutes.", "Stir all of the grains and beans together until well mixed. Grind in a flour mill. Add fresh milled flour and salt to the yeast mixture; stir until well mixed, about 10 minutes. The dough will be like that of a batter bread. Pour dough into two greased 9 x 5 inch loaf pans.", "Let rise in a warm place for about 1 hour, or until dough has reached the top of the pan.", "Bake at 350 degrees F (175 degrees C) for 45 to 50 minutes, or until loaves are golden brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/3571915.jpg", "prep_time_minutes": 50, "rating_stars": 3.87, "review_count": 40, "time_scraped": 1498206631, "title": "Ezekiel Bread I", "total_time_minutes": 135, "url": "http://allrecipes.com/Recipe/7047/"}
{"author": "Michele", "cook_time_minutes": 20, "description": "This recipe makes two fruity, moist loaves.", "error": false, "footnotes": [], "ingredients": ["4 eggs", "1 1/2 cups white sugar", "2 teaspoons vanilla extract", "1 cup vegetable oil", "1 1/2 teaspoons ground cinnamon", "3/4 teaspoon ground nutmeg", "1 (8 ounce) can crushed pineapple, drained", "2 cups grated zucchini", "3 cups all-purpose flour", "1 teaspoon salt", "1 1/2 teaspoons baking soda", "1 1/2 teaspoons baking powder"], "instructions": ["Combine flour, baking powder, baking soda, and salt.", "In a large bowl, mix oil, eggs, vanilla, sugar, cinnamon, and nutmeg. Blend in pineapple and zucchini. Stir flour mixture into zucchini mixture. Pour batter into two greased and floured 9 x 5 inch loaf pans.", "Bake at 350 degrees F (175 degrees C) for 1 hour. Cool on wire racks."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1326500.jpg", "prep_time_minutes": 60, "rating_stars": 4.44, "review_count": 178, "time_scraped": 1498206679, "title": "Zucchini Pineapple Bread I", "total_time_minutes": 80, "url": "http://allrecipes.com/Recipe/7048/"}
{"author": "ELLENMARIE", "cook_time_minutes": 15, "description": "This is for a pumpkin quick bread that has cream cheese in the middle.  I generally double it, and then it makes three 8 X 4 inch loaves.   This recipe freezes well.", "error": false, "footnotes": [], "ingredients": ["1 (8 ounce) package cream cheese", "1/4 cup white sugar", "1 egg, beaten", "1 3/4 cups all-purpose flour", "1 1/2 cups white sugar", "1 teaspoon baking soda", "1 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/4 teaspoon ground nutmeg", "1 cup pumpkin puree", "1/2 cup butter, melted", "1 egg, beaten", "1/3 cup water"], "instructions": ["Blend cream cheese, 1/4 cup sugar, and 1 beaten egg. Set aside.", "Combine flour, 1 1/2 cups white sugar, baking soda, salt, and spices. Set aside.", "Combine pumpkin, butter or margarine, beaten egg, and water. Add flour mixture to pumpkin mixture, mixing just until moistened. Reserve 2 cups of the pumpkin batter. Pour the remaining batter into a greased and floured 9 x 5 inch loaf pan. Pour cream cheese mixture over pumpkin batter, and top with reserved pumpkin batter. Cut through batter several times with a knife for a swirl effect.", "Bake at 350 degrees F (175 degrees C) for 70 minutes, or until tester comes out clean. Cool in the pan for 10 minutes, and then remove from pan to cool completely."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/835912.jpg", "prep_time_minutes": 70, "rating_stars": 4.5, "review_count": 125, "time_scraped": 1498207918, "title": "Pumpkin Swirl Bread", "total_time_minutes": 95, "url": "http://allrecipes.com/Recipe/7049/"}
{"author": "Janice", "cook_time_minutes": 20, "description": "This is a Swedish Christmas Bread with candied fruits and a yummy cardamom flavor.", "error": false, "footnotes": [], "ingredients": ["2 cups scalded milk", "1 cup butter, melted", "2 teaspoons salt", "1 cup white sugar", "2 (.25 ounce) packages active dry yeast", "1/2 cup warm water (110 degrees F/45 degrees C)", "8 1/2 cups all-purpose flour", "1 tablespoon ground cardamom", "1/2 cup candied cherries, sliced", "1/2 cup chopped candied citron", "1 cup golden raisins", "1 egg white, beaten"], "instructions": ["Dissolve yeast in water.", "Scald milk, and add melted butter or margarine, salt, sugar. When lukewarm add to yeast and water. Stir in 4 cups flour. Cover, and place in a warm place. Let rise for about 2 hours, or till doubled in bulk.", "Punch down. Stir in cardamom, cherries, raisins and citron. Work in remaining flour until soft dough forms. Let rise in warm place for 2 to 3 hours, or until doubled.", "Knead slightly, and form into 4 round loaves. Place on greased cookie sheets. Let rise for 1 to 2 hours, or till doubled. Brush loaves with beaten egg white.", "Bake at 350 degrees F (175 degrees C) for 30 to 40 minutes, or until golden brown."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/290169.jpg", "prep_time_minutes": 40, "rating_stars": 4.75, "review_count": 16, "time_scraped": 1498215562, "title": "Jule Kaka", "total_time_minutes": 360, "url": "http://allrecipes.com/Recipe/7050/"}
{"author": "Steve Lockhart", "cook_time_minutes": 5, "description": "60% whole wheat bread that works every time!!", "error": false, "footnotes": [], "ingredients": ["1 1/3 cups water", "1 1/2 tablespoons dry milk powder", "1 tablespoon molasses", "1 tablespoon honey", "3 tablespoons margarine", "1 teaspoon white sugar", "1 teaspoon salt", "1/2 cup rye flour", "2 cups whole wheat flour", "1 cup bread flour", "2 3/4 teaspoons active dry yeast"], "instructions": ["Place the ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select Whole Wheat setting, and Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1812319.jpg", "prep_time_minutes": 180, "rating_stars": 4.5, "review_count": 11, "time_scraped": 1498206176, "title": "Steve's Whole Wheat", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7051/"}
{"author": "Liz Bartholomew", "cook_time_minutes": 5, "description": "Make an outrageously delightful oatmeal bread from your bread machine", "error": false, "footnotes": [], "ingredients": ["1 1/4 cups water", "3 cups bread flour", "2 tablespoons honey", "1 1/2 tablespoons dry milk powder", "1 1/2 teaspoons salt", "1/2 cup quick cooking oats", "2 tablespoons margarine", "1 tablespoon active dry yeast"], "instructions": ["Place ingredients in the pan of the bread machine in the order recommended by the manufacturer. Select White Bread setting, and Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/57347.jpg", "prep_time_minutes": 180, "rating_stars": 4.6, "review_count": 58, "time_scraped": 1498208208, "title": "Oatmeal Bread II", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7052/"}
{"author": "Nicole Ribecca", "cook_time_minutes": 5, "description": "As Hawaiin as I am, this one is a shocker! But it tastes great, the beer gives it a delightful yeasty taste.", "error": false, "footnotes": [], "ingredients": ["1 (8 ounce) can pineapple chunks", "2 3/4 cups self-rising flour", "1/3 cup white sugar", "1 (12 fluid ounce) can or bottle beer"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease one 9x5 inch baking pan.", "Combine the pineapple flour, sugar and beer. Do not overmix! Pour batter into the prepared pan.", "Bake at 350 degrees F (175 degrees C) for about 1 hour or until bread tests done."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/407035.jpg", "prep_time_minutes": 60, "rating_stars": 2.18, "review_count": 9, "time_scraped": 1498205303, "title": "Dizzy Pineapple Bread", "total_time_minutes": 65, "url": "http://allrecipes.com/Recipe/7054/"}
{"author": "Kevin Ryan", "cook_time_minutes": 10, "description": "This bread takes pumpkin bread to a whole new realm. I invented this one day when thinking of how to make pumpkin bread retain its moistness even longer. Solution: coconut milk!", "error": false, "footnotes": ["Partner tip: Reynolds® Aluminum foil can be used to keep food moist, cook it evenly, and make clean-up easier."], "ingredients": ["3 1/2 cups all-purpose flour", "2 cups packed dark brown sugar", "2/3 cup white sugar", "1 (15 ounce) can pumpkin puree", "1 cup vegetable oil", "2/3 cup coconut milk", "2 teaspoons baking soda", "1 teaspoon salt", "1 teaspoon ground nutmeg", "1 1/2 teaspoons ground cinnamon", "2/3 cup unsweetened flaked coconut", "1 cup chopped walnuts, toasted"], "instructions": ["Preheat oven to 350 degrees F (175 degrees C). Grease and flour two 8 x 4 inch loaf pans.", "Combine flour, sugars, pumpkin, oil, coconut milk, baking soda, salt, and spices. Mix until well blended. Fold in coconut and nuts. Pour into prepared pans.", "Bake for about 1 hour and 15 minutes, or until an inserted toothpick comes out clean. Remove from oven. Cover with foil tightly, and allow to steam 10 minutes. Remove foil, and turn out onto cooling rack. Tent lightly with the foil, and allow to cool completely."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/510657.jpg", "prep_time_minutes": 75, "rating_stars": 4.55, "review_count": 49, "time_scraped": 1498206397, "title": "Coconut Pumpkin Nut Bread", "total_time_minutes": 95, "url": "http://allrecipes.com/Recipe/7053/"}
{"author": "Jan", "cook_time_minutes": 5, "description": "This is an easy recipe for a loaf of black bread with caraway seed for bread machines.", "error": false, "footnotes": [], "ingredients": ["7/8 cup water", "3/4 teaspoon cider vinegar", "1 1/2 cups bread flour", "1/2 cup rye flour", "1/4 cup oat bran", "1 tablespoon margarine", "1 1/2 tablespoons white sugar", "1 teaspoon salt", "1 teaspoon caraway seed", "1 teaspoon dried minced onion", "2 tablespoons unsweetened cocoa powder", "1 teaspoon active dry yeast"], "instructions": ["Place the ingredients in the pan of the bread machine in the order suggested by the manufacturer. Select Normal setting, and then press Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/698.jpg", "prep_time_minutes": 180, "rating_stars": 4.0, "review_count": 14, "time_scraped": 1498206653, "title": "European Black Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7055/"}
{"author": "Joe Beck", "cook_time_minutes": 5, "description": "This is a spicy bread, good with black bean soup.  Make it for the chili lover in your life.", "error": false, "footnotes": [], "ingredients": ["7/8 cup beer", "1 teaspoon beef bouillon", "1/4 teaspoon ground cayenne pepper", "1/4 teaspoon hot chile oil", "1 tablespoon olive oil", "2 1/4 cups bread flour", "1/8 teaspoon ground cumin", "1 tablespoon dried minced onion", "1 teaspoon chili powder", "1/4 teaspoon garlic powder", "1/2 teaspoon salt", "2 teaspoons active dry yeast"], "instructions": ["Place the ingredients in the pan of the bread machine in the order suggested by the manufacturer. Select the French Bread or White Bread setting, and then press Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1009074.jpg", "prep_time_minutes": 180, "rating_stars": 4.39, "review_count": 20, "time_scraped": 1498207126, "title": "Chili Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7056/"}
{"author": "Julie", "cook_time_minutes": 10, "description": "Old fashioned New England flavor using a bread machine!  You can mix the bread in the machine then bake it in the regular oven using your favorite pans, I do.", "error": false, "footnotes": [], "ingredients": ["1 5/8 cups water", "4 cups bread flour", "2 tablespoons butter", "2 tablespoons dry milk powder", "1/3 cup molasses", "1 tablespoon active dry yeast", "2 teaspoons salt"], "instructions": ["Place ingredients in the bread machine pan in the order suggested by the manufacturer. Select Dough or White Bread setting, and then Start.", "If the dough does not form a ball on the paddle, add 1 tablespoon of flour at a time until the ball forms. Allow machine to complete selected cycle.", "To bake conventionally, remove the dough from the bread machine pan after the Dough cycle has completed. Shape into a loaf, and place in a greased 9 x 5 inch loaf pan. Let rise until doubled. Bake at 350 degrees F (175 degrees C) for about 40 minutes."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/198558.jpg", "prep_time_minutes": 40, "rating_stars": 4.43, "review_count": 22, "time_scraped": 1498205846, "title": "Old Fashion Molasses Bread", "total_time_minutes": 200, "url": "http://allrecipes.com/Recipe/7057/"}
{"author": "MELH", "cook_time_minutes": 5, "description": "This is our family favorite! Very moist.", "error": false, "footnotes": [], "ingredients": ["1 1/8 cups water", "3 cups whole wheat flour", "1 1/2 teaspoons salt", "1/3 cup honey", "1 tablespoon dry milk powder", "1 1/2 tablespoons shortening", "1 1/2 teaspoons active dry yeast"], "instructions": ["Place ingredients in bread machine pan in the order suggested by the manufacturer. Select Whole Wheat setting, and then press Start."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/19436.jpg", "prep_time_minutes": 180, "rating_stars": 4.66, "review_count": 711, "time_scraped": 1498206655, "title": "Whole Wheat Honey Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7058/"}
{"author": "Kevin", "cook_time_minutes": 5, "description": "Savory and tasty!", "error": false, "footnotes": [], "ingredients": ["2 1/2 teaspoons active dry yeast", "1 cup rye flour", "2 1/4 cups bread flour", "1/2 cup cornmeal", "1 1/2 tablespoons white sugar", "1 1/2 tablespoons dried thyme", "1 1/2 teaspoons salt", "1 cup water", "2 cups grated carrots", "3 tablespoons vegetable oil"], "instructions": ["Place the ingredients in the bread machine pan in the order suggested by the manufacturer. Select Basic Bread setting, and then press Start.", "Allow the loaf to cool before slicing."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/246728.jpg", "prep_time_minutes": 180, "rating_stars": 4.0, "review_count": 6, "time_scraped": 1498206154, "title": "Carrot Thyme Bread", "total_time_minutes": 185, "url": "http://allrecipes.com/Recipe/7059/"}
{"author": "Kevin Ryan", "cook_time_minutes": 10, "description": "A trip to the health food store will be necessary for these flapjacks, but it is worth it. While there, pick up some real maple syrup to serve with them!", "error": false, "footnotes": [], "ingredients": ["1 egg", "1/4 cup apple juice", "1 tablespoon unsalted butter, melted", "1/4 cup amaranth flour", "1/4 cup tapioca flour", "3 tablespoons arrowroot flour", "1/4 teaspoon ground cinnamon", "1 pinch ground nutmeg", "1/2 teaspoon wheat-free baking powder", "1/4 teaspoon salt"], "instructions": ["In a medium mixing bowl, beat the egg with the apple juice and melted butter. Add the remaining ingredients and stir.", "Heat a lightly oiled griddle or frying pan over medium high heat. Pour or scoop the batter onto the griddle, using approximately 1/4 cup for each pancake. Brown on both sides and serve hot. This batter must be used right away and can not sit and wait."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/1584094.jpg", "prep_time_minutes": 15, "rating_stars": 4.14, "review_count": 12, "time_scraped": 1498208549, "title": "Golly Gee Gluten-Free Pancakes", "total_time_minutes": 25, "url": "http://allrecipes.com/Recipe/7060/"}
{"author": "Valarie", "cook_time_minutes": 20, "description": "THIS IS NOT AN EASY BREAD TO MAKE! It is tricky, but worth the effort for one who loves that very different, pungent smell of salt-rising bread. The cornmeal used for the starter must contain the inner germ of the corn and a constant warm temperature must be maintained.", "error": false, "footnotes": [], "ingredients": ["1 cup milk", "1/2 cup cornmeal", "1 tablespoon white sugar", "1 teaspoon salt", "2 cups warm water (110 degrees F/45 degrees C)", "2 cups all-purpose flour", "2 tablespoons white sugar", "3 tablespoons shortening", "1/2 teaspoon baking soda", "1 tablespoon warm water (110 degrees F/45 degrees C)", "6 cups all-purpose flour"], "instructions": ["To Make Starter: Heat the milk, and stir in 1 tablespoon of the sugar, the cornmeal and 1 teaspoon of the salt. Place this in a jar in an electric skillet or crock pot with hot water in it. Maintain the temperature around 105 to 115 degrees F (40 to 47 degrees C) for 7-12 hours or until it shows fermentation. You can hear the gas escaping when it has fermented sufficiently. The bubble foam, which forms over the starter, can take as long as 24 hours. Do not go on with the bread-making until the starter responds. As the starter ferments, the unusual salt-rising smell appears.", "When the starter is bubbly, it is time to make the sponge. Place the starter mixture in a medium-size bowl. Stir in 2 cups of the warm water, 2 tablespoons of the sugar, the shortening and 2 cups of the all-purpose flour. Beat the sponge thoroughly. Put bowl back in the water to maintain an even 105 to 115 degrees F (40 to 47 degrees C) temperature. Cover, and let rise until light and full of bubbles. This will take 2 1/2 to 3 hours.", "Dissolve the baking soda in 1 tablespoon of the warm water and combine it with the sponge. Stir 5 1/4 cups of the flour into the sponge; knead in more flour as necessary. Knead the dough for 10 minutes or until smooth and manageable. Cut dough into 3 parts. Shape dough and place it in three greased 9x5x3 inch pans. Place covered pans in warm water or uncovered pans in a warm oven with a bowl of hot water, maintaining a temperature of 85 degrees F (30 degrees C). It will take approximately 5 hours for the bread to rise 2 1/2 times the original size. The bread will round to the top of the pans.", "Preheat the oven to 375 degrees F (190 degrees C).", "Bake bread at 375 degrees F (190 degrees C) for 10 minutes. Reduce oven temperature to 350 degrees F (175 degrees C) and bake for an additional 20 minutes or until light golden brown. YOU CAN DRY SALT RISING CULTURE!!! Save 1/4 cup of a successful sponge and pour it into a saucer, cover with cheesecloth and allow to dry. Store dried flakes in plastic in a cool, dry place or freeze until needed for salt rising bread. When ready to make the bread; dissolve the flakes in the new warm starter and continue with recipe. This will give a flavor boost to your bread."], "photo_url": "http://images.media-allrecipes.com/userphotos/560x315/4157171.jpg", "prep_time_minutes": 30, "rating_stars": 4.63, "review_count": 24, "time_scraped": 1498206739, "title": "Salt Rising Bread", "total_time_minutes": 0, "url": "http://allrecipes.com/Recipe/7061/"}
{"author": "Nancy", "cook_time_minutes": 20, "description": "Pretzels where the dough is mixed in the bread machine.", "error": false, "footnotes": [], "ingredients": ["1 cup beer", "1 tablespoon margarine", "2 tablespoons white sugar", "1 teaspoon salt", "3 cups all-purpose flour", "3/4 teaspoon active dry yeast", "1 egg", "1 tablespoon warm water (110 degrees F/45 degrees C)", "2 tablespoons kosher salt"], "instructions": ["Measure first 6 ingredients in order listed into baking pan. Select: Dough/Pasta Setting and press start.", "When the cycle is complete remove dough to a lightly floured surface. If necessary, knead in enough flour to make dough easy to handle. Roll into a 14X9 inch rectangle. With a sharp knife, cut into eighteen 14X1/2 inch strips. Gently pull each strip into a rope 16 inches long. To shape into pretzels: Curve ends of each rope to make a circle; cross ends at top. Twist ends once and lay over bottom of circle. Place on greased baking sheets. DO NOT LET RISE.", "Combine lightly beaten egg and 1tablespoon water; brush on pretzels. Sprinkle with kosher salt. Bake in a preheated 350 degrees F (175 degrees C) oven for 18-20 minutes or until done. Remove from sheets and let pretzels cool on wire rack. Enjoy!"], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/83527.jpg", "prep_time_minutes": 20, "rating_stars": 3.88, "review_count": 39, "time_scraped": 1498206415, "title": "Baked Pretzels", "total_time_minutes": 160, "url": "http://allrecipes.com/Recipe/7062/"}
{"author": "GINNY LEE", "cook_time_minutes": 30, "description": "Make something special to share with a friend! This delicious starter can make a variety of breads. Do not use metal containers or utensils.", "error": false, "footnotes": ["Editor's Note:", "Once you have made the starter, you will consider it Day One, and thus ignore step 1 in this recipe and proceed with step 2. You can also freeze this starter in 1 cup measures for later use. Frozen starter will take at least 3 hours at room temperature to thaw before using."], "ingredients": ["1 (.25 ounce) package active dry yeast", "1/4 cup warm water (110 degrees F/45 degrees C)", "3 cups all-purpose flour, divided", "3 cups white sugar, divided", "3 cups milk"], "instructions": ["In a small bowl, dissolve yeast in water. Let stand 10 minutes. In a 2 quart container glass, plastic or ceramic container, combine 1 cup flour and 1 cup sugar. Mix thoroughly or flour will lump when milk is added. Slowly stir in 1 cup milk and dissolved yeast mixture. Cover loosely and let stand until bubbly. Consider this day 1 of the 10 day cycle. Leave loosely covered at room temperature.", "On days 2 through 4; stir starter with a spoon. Day 5; stir in 1 cup flour, 1 cup sugar and 1 cup milk. Days 6 through 9; stir only.", "Day 10; stir in 1 cup flour, 1 cup sugar and 1 cup milk. Remove 1 cup to make your first bread, give 2 cups to friends along with this recipe, and your favorite Amish Bread recipe. Store the remaining 1 cup starter in a container in the refrigerator, or begin the 10 day process over again (beginning with step 2)."], "photo_url": "http://images.media-allrecipes.com/userphotos/250x250/676554.jpg", "prep_time_minutes": 0, "rating_stars": 4.7, "review_count": 286, "time_scraped": 1498206700, "title": "Amish Friendship Bread Starter", "total_time_minutes": 0, "url": "http://allrecipes.com/Recipe/7063/"}
