{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Need to start neo4j\n",
    "#Install neo4j adaptor\n",
    "pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import subprocess as sp\n",
    "\n",
    "sp.call(\"powershell Start-Process 'C:/Program Files/Neo4j Desktop/resources/offline/neo4j/neo4j-enterprise-3.5.6-windows.zip/neo4j-enterprise-3.5.6/bin/neo4j.bat' start -verb runAs\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Connected: http://neo4j:test@localhost:7474/db/data/'"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#%cypher http://username:password@localhost:7474/db/data/\n",
    "%cypher http://neo4j:test@localhost:7474/db/data/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u1.name</th>\n",
       "      <th>u2.name</th>\n",
       "      <th>i.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>salt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>egg</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>white sugar</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Orange Buns</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       u1.name      u2.name            i.name\n",
       "0  Orange Buns  Dilly Bread              salt\n",
       "1  Orange Buns  Dilly Bread               egg\n",
       "2  Orange Buns  Dilly Bread       white sugar\n",
       "3  Orange Buns  Dilly Bread  active dry yeast"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (u1:recipes {name:\"Orange Buns\"})-[r1:CONTAINS]->(i:ingredients)<-[r2:CONTAINS]-(u2:recipes {name:\"Dilly Bread\"}) RETURN DISTINCT u1.name, u2.name, i.name ORDER BY u2.name\n",
    "#results = %cypher MATCH (u1:recipes {name:\"Orange Buns\"})-[r1:CONTAINS]->(i:ingredients)<-[r2:CONTAINS]-(u2:recipes {name:\"Dilly Bread\"}) RETURN i.name ORDER BY u2.name\n",
    "r = results.get_dataframe()\n",
    "r"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "25 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u1.name</th>\n",
       "      <th>u2.name</th>\n",
       "      <th>i.name</th>\n",
       "      <th>i1.name</th>\n",
       "      <th>i2.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Unbelievable Rolls</td>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Sourdough Bread II</td>\n",
       "      <td>Dilly Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Onion Bread I</td>\n",
       "      <td>Canadian Doughnuts</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Unbelievable Rolls</td>\n",
       "      <td>Cinnamon Cranraisin Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Sy's Challah</td>\n",
       "      <td>Sun Dried Tomato and Asiago Cheese Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Grandma Cornish's Whole Wheat Potato Bread</td>\n",
       "      <td>Sun Dried Tomato and Asiago Cheese Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Parmesan Herb Bread</td>\n",
       "      <td>Sunday Dinner Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>Fabulous Homemade Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Potato Bread I</td>\n",
       "      <td>Parmesan Herb Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>English Muffin Loaves</td>\n",
       "      <td>Potato Bread I</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>English Muffin Loaves</td>\n",
       "      <td>Fabulous Homemade Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Sun Dried Tomato Focaccia</td>\n",
       "      <td>Sweet Potato Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Cardamom Bread</td>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>Parmesan Herb Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Mom's Yeast Rolls</td>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Parmesan Herb Bread</td>\n",
       "      <td>Potato Bread I</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>Mom's Yeast Rolls</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Canadian Doughnuts</td>\n",
       "      <td>Sun Dried Tomato Focaccia</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Onion Bread I</td>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Sun Dried Tomato and Asiago Cheese Bread</td>\n",
       "      <td>Hawaiian Sweet Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>English Muffin Loaves</td>\n",
       "      <td>Molasses-Oat Bran Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>No Knead Refrigerator Rolls</td>\n",
       "      <td>Soft Pretzels I</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Sun Dried Tomato Focaccia</td>\n",
       "      <td>Hawaiian Sweet Bread</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Grandma VanDoren's White Bread</td>\n",
       "      <td>Potato Bread I</td>\n",
       "      <td>white sugar</td>\n",
       "      <td>salt</td>\n",
       "      <td>active dry yeast</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       u1.name  \\\n",
       "0                           Unbelievable Rolls   \n",
       "1               Grandma VanDoren's White Bread   \n",
       "2                           Sourdough Bread II   \n",
       "3                                Onion Bread I   \n",
       "4                           Unbelievable Rolls   \n",
       "5                                 Sy's Challah   \n",
       "6   Grandma Cornish's Whole Wheat Potato Bread   \n",
       "7                          Parmesan Herb Bread   \n",
       "8               Grandma VanDoren's White Bread   \n",
       "9                               Potato Bread I   \n",
       "10                       English Muffin Loaves   \n",
       "11                       English Muffin Loaves   \n",
       "12                   Sun Dried Tomato Focaccia   \n",
       "13                              Cardamom Bread   \n",
       "14                 No Knead Refrigerator Rolls   \n",
       "15                           Mom's Yeast Rolls   \n",
       "16                         Parmesan Herb Bread   \n",
       "17                     Molasses-Oat Bran Bread   \n",
       "18                          Canadian Doughnuts   \n",
       "19                               Onion Bread I   \n",
       "20    Sun Dried Tomato and Asiago Cheese Bread   \n",
       "21                       English Muffin Loaves   \n",
       "22                 No Knead Refrigerator Rolls   \n",
       "23                   Sun Dried Tomato Focaccia   \n",
       "24              Grandma VanDoren's White Bread   \n",
       "\n",
       "                                     u2.name       i.name i1.name  \\\n",
       "0                No Knead Refrigerator Rolls  white sugar    salt   \n",
       "1                    Molasses-Oat Bran Bread  white sugar    salt   \n",
       "2                                Dilly Bread  white sugar    salt   \n",
       "3                         Canadian Doughnuts  white sugar    salt   \n",
       "4                  Cinnamon Cranraisin Bread  white sugar    salt   \n",
       "5   Sun Dried Tomato and Asiago Cheese Bread  white sugar    salt   \n",
       "6   Sun Dried Tomato and Asiago Cheese Bread  white sugar    salt   \n",
       "7                        Sunday Dinner Rolls  white sugar    salt   \n",
       "8                    Fabulous Homemade Bread  white sugar    salt   \n",
       "9                        Parmesan Herb Bread  white sugar    salt   \n",
       "10                            Potato Bread I  white sugar    salt   \n",
       "11                   Fabulous Homemade Bread  white sugar    salt   \n",
       "12                        Sweet Potato Rolls  white sugar    salt   \n",
       "13               No Knead Refrigerator Rolls  white sugar    salt   \n",
       "14                       Parmesan Herb Bread  white sugar    salt   \n",
       "15                   Molasses-Oat Bran Bread  white sugar    salt   \n",
       "16                            Potato Bread I  white sugar    salt   \n",
       "17                         Mom's Yeast Rolls  white sugar    salt   \n",
       "18                 Sun Dried Tomato Focaccia  white sugar    salt   \n",
       "19            Grandma VanDoren's White Bread  white sugar    salt   \n",
       "20                      Hawaiian Sweet Bread  white sugar    salt   \n",
       "21                   Molasses-Oat Bran Bread  white sugar    salt   \n",
       "22                           Soft Pretzels I  white sugar    salt   \n",
       "23                      Hawaiian Sweet Bread  white sugar    salt   \n",
       "24                            Potato Bread I  white sugar    salt   \n",
       "\n",
       "             i2.name  \n",
       "0   active dry yeast  \n",
       "1   active dry yeast  \n",
       "2   active dry yeast  \n",
       "3   active dry yeast  \n",
       "4   active dry yeast  \n",
       "5   active dry yeast  \n",
       "6   active dry yeast  \n",
       "7   active dry yeast  \n",
       "8   active dry yeast  \n",
       "9   active dry yeast  \n",
       "10  active dry yeast  \n",
       "11  active dry yeast  \n",
       "12  active dry yeast  \n",
       "13  active dry yeast  \n",
       "14  active dry yeast  \n",
       "15  active dry yeast  \n",
       "16  active dry yeast  \n",
       "17  active dry yeast  \n",
       "18  active dry yeast  \n",
       "19  active dry yeast  \n",
       "20  active dry yeast  \n",
       "21  active dry yeast  \n",
       "22  active dry yeast  \n",
       "23  active dry yeast  \n",
       "24  active dry yeast  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results1 = %cypher MATCH (u1:recipes)--(i:ingredients {name:\"white sugar\"})--(u2:recipes) \\\n",
    "MATCH (u1:recipes)--(i1:ingredients {name:\"salt\"})--(u2:recipes) \\\n",
    "MATCH (u1:recipes)--(i2:ingredients {name:\"active dry yeast\"})--(u2:recipes) \\\n",
    "RETURN DISTINCT u1.name, u2.name, i.name, i1.name, i2.name LIMIT 25;\n",
    "r1 = results1.get_dataframe()\n",
    "r1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "#pip install pyviz"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['u1.name', 'u2.name', 'i.name', 'i1.name', 'i2.name']"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "list(r1.columns.values) "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyvis.network import Network\n",
    "import networkx as nx\n",
    "net = Network()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "graphr = nx.from_pandas_edgelist(r1, source = 'u1.name', target = 'u2.name')\n",
    "#nx.draw_networkx(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "#net.add_nodes(a['u1.name'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "#nxg = nx.complete_graph(10)\n",
    "#G = Network()\n",
    "#G.from_nx(nxg)\n",
    "\n",
    "net.from_nx(graphr)\n",
    "\n",
    "#net.enable_physics(True)\n",
    "net.show_buttons(filter_=['physics'])\n",
    "net.show(\"mygraph.html\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Actual code starts from here:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "from ipywidgets import interact, interactive, fixed, interact_manual\n",
    "import ipywidgets as widgets\n",
    "from IPython.display import display"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import networkx as nx\n",
    "\n",
    "df = pd.read_csv(\"C:/Users/KE/Documents/GitHub/NUS/Bigdata/Code/data/Recipe_Ingredients_Graph.csv\")\n",
    "g = nx.from_pandas_edgelist(df, source = 'Recipe', target = 'Ingredients')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "#def dropdown(SearchTerm):\n",
    "#    return SearchTerm\n",
    "\n",
    "#search = interact(dropdown, SearchTerm = (g));"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "7ab3b3cf2919409ea7b560ee5ed3b2c8",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Dropdown(description='Ingredients:', options=('unsalted butter', 'parmesan cheese', 'hot water', 'white sugar'…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "search1 = widgets.Dropdown(\n",
    "       options=df['Ingredients'],\n",
    "       description='Ingredients:')\n",
    "search1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "8cea12095556411f97204788325cb735",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Dropdown(description='Ingredients:', options=('unsalted butter', 'parmesan cheese', 'hot water', 'white sugar'…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "search2 = widgets.Dropdown(\n",
    "       options=df['Ingredients'],\n",
    "       description='Ingredients:')\n",
    "search2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "6895b90cc9eb4647bec66215e66a67dc",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "Dropdown(description='Ingredients:', options=('unsalted butter', 'parmesan cheese', 'hot water', 'white sugar'…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "search3 = widgets.Dropdown(\n",
    "       options=df['Ingredients'],\n",
    "       description='Ingredients:')\n",
    "search3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pyvis.network import Network\n",
    "import networkx as nx\n",
    "net = Network()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Need to start neo4j\n",
    "#Install neo4j adaptor\n",
    "pip install ipython-cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Connected: http://neo4j:test@localhost:7474/db/data/'"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%load_ext cypher\n",
    "%cypher http://neo4j:test@localhost:7474/db/data/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "5f23b9d5a2884a409c753f33399ac934",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "interactive(children=(Text(value='unsalted butter', description='search1v'), Text(value='unsalted butter', des…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "@interact\n",
    "\n",
    "def fx(search1v = search1.value, search2v = search2.value, search3v = search3.value):\n",
    "    searchR = %cypher MATCH (u1:recipes)--(i:ingredients {name:$search1v})--(u2:recipes) \\\n",
    "MATCH (u1:recipes)--(i1:ingredients {name:$search2v})--(u2:recipes) \\\n",
    "MATCH (u1:recipes)--(i2:ingredients {name:$search3v})--(u2:recipes) \\\n",
    "RETURN DISTINCT u1.name, u2.name, i.name, i1.name, i2.name LIMIT 25;\n",
    "    \n",
    "    #test = df.loc[df['Recipe']==search]\n",
    "    \n",
    "\n",
    "    \n",
    "    searchResult = searchR.get_dataframe()\n",
    "\n",
    "    grap = nx.from_pandas_edgelist(searchResult, source = 'u1.name', target = 'u2.name')\n",
    "    net.from_nx(grap)\n",
    "    net.show_buttons(filter_=['physics'])    \n",
    "    \n",
    "    net.show(\"mygraph.html\")\n",
    "\n",
    "    return searchR\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "7c6b4ba0861b4fc6809f1767db422a82",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "interactive(children=(Text(value='unsalted butter', description='search1v'), Text(value='unsalted butter', des…"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "<function __main__.fx>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "display(interact_manual(fx))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''var options = {\n",
    "  \"physics\": {\n",
    "    \"hierarchicalRepulsion\": {\n",
    "      \"centralGravity\": 0,\n",
    "      \"springLength\": 35,\n",
    "      \"nodeDistance\": 140,\n",
    "      \"damping\": 0.77\n",
    "    },\n",
    "    \"maxVelocity\": 31,\n",
    "    \"minVelocity\": 0.75,\n",
    "    \"solver\": \"hierarchicalRepulsion\",\n",
    "    \"timestep\": 0.86\n",
    "  }\n",
    "}\n",
    "'''"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
